{
  "common": {
    "accessibility_and_usability": "Saavutettavuus ja käytettävyys",
    "see_technical_documentation_of_component": "Katso komponentin tekninen dokumentaatio",
    "opens_in_a_new_tab": "Avautuu uudessa välilehdessä",
    "skip_to_main_content": "Siirry pääsisältöön",
    "skip_to_side_navigation": "Siirry sivunavigaatioon"
  },
  "front_page": {
    "front_page": "Etusivu",
    "hero_heading": "Suomi.fi Design System – digipalvelujen yhteiset rakennuspalikat",
    "hero_text": "Suomi.fi Design System on kokoelma Digi- ja väestötietoviraston yhteisiä tyylejä, suunnittelumalleja ja suunnitteluohjeita. Design Systemiin kuuluu lisäksi suunnitteluohjeiden pohjalta toteutettu komponenttikirjasto. Kaikki suunnittelumallit ja komponentit on toteutettu ja testattu saavutettavuusvaatimusten mukaisesti (WCAG 2.1).",
    "heading": "Mitä Suomi.fi Design System sisältää?",
    "sub_heading_1": "Design System -sivusto",
    "paragraph_1": "Tältä sivustolta löydät tiedot kaikista Suomi.fi Design Systemissä julkaistuista komponenteista, ja kunkin komponentin yhteydestä myös esikatselumallit ja käyttöohjeistukset. Ohjeistuksessa nostetaan esille erityisesti saavutettavuuteen ja käytettävyyteen liittyviä asioita. Komponentit ovat vapaasti hyödynnettävissä joko sellaisenaan, tai niitä voi muokata vastaamaan oman palvelun visuaalista ulkoasua. Suomi.fi Design System -kirjastoa kehittää ja ylläpitää Digi- ja väestötietovirasto.",
    "link_1": "Lue taustatietoja Suomi.fi Design Systemistä",
    "sub_heading_2": "Käyttöliittymäkomponenttien kirjasto",
    "paragraph_2": "Suomi.fi Design System -kirjasto perustuu Suomi.fi-palveluiden käyttökokemukseen ja käyttöliittymäkomponentteihin. Käyttöliittymäkomponenttikirjastoa ja suunnittelun pohjana olevaa tyyliopasta kehitetään jatkuvasti osana Suomi.fi-palvelujen kehitystä. Parannuksia ja lisäyksiä tehdään saavutettavuuden, käytettävyyden ja palveluiden tarpeiden mukaisesti.",
    "paragraph_3": "Käyttöliittymien kaikki elementit on suunniteltu ja kehitetty saavutettavuusvaatimusten mukaan (WCAG 2.1 -kriteeristön tasot A ja AA). Komponentit julkaistaan ReactJS (Javascript) ‑muodossa ja julkaistava kirjasto noudattaa semanttista versiointia.",
    "link_2": "Tutustu komponentteihin",
    "link_3": "Komponenttikirjaston tekninen dokumentaatio",
    "paragraph_4": "Onko sinulla ehdotuksia tai muuta palautetta?",
    "link_4": "Yhteystiedot"
  },
  "footer": {
    "left_text": "Suomi.fi Design Systemin kehittämisestä vastaa Digi- ja väestötietovirasto.",
    "cookies": "Evästekäytännöt",
    "accessibility": "Saavutettavuusseloste"
  },
  "main_nav": {
    "home": "Etusivu",
    "styles": "Tyylit",
    "components": "Komponentit",
    "patterns": "Suunnittelumallit",
    "info": "Taustatietoa"
  },
  "privacy_statement": {
    "heading": "Evästekäytännöt",
    "paragraph_1": "Designsystem.suomi.fi -sivusto tallentaa käyttäjän vierailusta käyttäjän selaimen muistiin tietoja, joita se vaatii toimiakseen. Näitä tietoja ovat esimerkiksi käyttäjän sijainti sivustolla sekä kielivalinta.",
    "paragraph_2": "Näitä tietoja ei lähetetä eteenpäin, eikä käsitellä tai talleteta siten, että yksittäinen käyttäjä olisi tunnistettavissa. Voit estää tietojen tallentamisen selaimesi evästeasetuksista tai asentamalla tähän tarkoitetun lisäosan selaimeesi. Evästeitä saatetaan käyttää välttämättömänä osana sähköisen palvelun tarjoamista. Tällaisten evästeiden estäminen saattaa estää samalla myös sähköisen palvelun käytön."
  },
  "accessibility_statement": {
    "heading": "Suomi.fi Design Systemin saavutettavuusseloste",
    "paragraph_1": "Tässä saavutettavuusselosteessa kerrotaan, miten Suomi.fi Design System -sivustolla noudatetaan lakia digitaalisten palvelujen tarjoamisesta, mitä puutteita sivuston saavutettavuudessa on ja miten voit antaa meille palautetta saavutettavuusongelmista. Seloste on laadittu 19.9.2019.",
    "paragraph_2": "Tästä verkkopalvelusta vastaa Digi- ja väestötietovirasto. Haluamme, että mahdollisimman moni käyttäjä pystyy käyttämään digitaalisia palvelujamme. Otamme saavutettavuuden huomioon digitaalisten palvelujen kehityksessä. Palvelujen saavutettavuutta arvioidaan säännöllisesti osana suunnittelu- ja kehitystyötä.",
    "how_accessible_are_pages": {
      "heading": "Miten saavutettavia sivut ovat?",
      "paragraph": "Tämä sivusto täyttää lain vaatimat A- ja AA-tason saavutettavuuskriteerit (WCAG-kriteeristö 2.1)."
    },
    "notice_problems": {
      "heading": "Huomasitko puutteita saavutettavuudessa?",
      "paragraph": "Pyrimme jatkuvasti huolehtimaan saavutettavuudesta. Jos löydät ongelmia, ilmoita niistä meille ja teemme parhaamme puutteiden korjaamiseksi. Vastaamme mahdollisimman pian tai viimeistään kahden viikon sisällä. Voit ottaa yhteyttä sähköpostitse osoitteella saavutettavuus(at)dvv.fi."
    },
    "supervision": {
      "heading": "Saavutettavuuden valvonta",
      "paragraph": "Etelä-Suomen aluehallintovirasto valvoo saavutettavuusvaatimusten toteutumista. Jos et ole tyytyväinen saamaasi vastaukseen tai et saa vastausta lainkaan kahden viikon aikana, voit antaa palautteen Etelä-Suomen aluehallintovirastoon. Etelä-Suomen aluehallintoviraston sivulla kerrotaan tarkasti, miten valituksen voi tehdä ja miten asia käsitellään."
    },
    "contacts": {
      "heading": "Valvontaviranomaisen yhteystiedot",
      "paragraph_1": "Etelä-Suomen aluehallintovirasto",
      "paragraph_2": "Saavutettavuuden valvonnan yksikkö",
      "paragraph_3": "www.saavutettavuusvaatimukset.fi",
      "paragraph_4": "sähköposti: saavutettavuus(at)avi.fi",
      "paragraph_5": "puhelin: vaihde 0295 016 000"
    },
    "testing": {
      "heading": "Miten olemme testanneet saavutettavuutta?",
      "paragraph": "Saavutettavuus on huomioitu Digi- ja väestötietoviraston digitaalisten palvelujen kehityksessä suunnittelusta toteutukseen kokonaisketterän mallin mukaisesti. Verkkosivuston saavutettavuutta on arvioinut Digi- ja väestötietoviraston hankkima saavutettavuusasiantuntija säännöllisesti osana suunnittelu- ja kehitysprosessia."
    }
  },
  "patterns": {
    "general": "Yleistä suunnittelumalleista",
    "multi_insert": "Multi-insert"
  },
  "patterns_main_page": {
    "ingress": "Suunnittelumallit eli patternit ovat kokoelma käyttölittyymäsuunnittelun periaatteeita ja ratkaisuja. Ne koostuvat ohjeistuksista ja esimerkeistä käyttöliittymien tai niiden osasten rakentamisen tueksi.",
    "paragraph_1": "Suunnittelumalleissa on kuvattu, kuinka erillisiä Design Systemin komponentteja käytetään yhdessä luomaan ratkaisuja, jotka on ovat käytettävyydeltään, visuaaliselta ilmeeltään ja saavutettavuudeltaan sujuvia ja parhaiden käytänteiden mukaisia.",
    "paragraph_2": "Jokaisen suunnittelumallin yhteydessä on esitelty referenssitoteutus, jota mukailemalla vastaava toiminnalisuus on helppo toteuttaa omaan palveluun. Referenssitoteutuksen lähdekoodi on myös saatavilla."
  },
  "multi-insert": {
    "heading": "Multi-insert",
    "ingress": "Lomakkeissa on toisinaan tarpeen lisätä sama moduuli eli tietokenttä tai tietokenttien yhdistelmä useaan kertaan. Tämän kaltaisen dynaamisen toiminnallisuuden toteuttamisessa on kiinnitettävä erityistä huomiota käytettävyyteen ja saavutettavuuteen.",
    "and_other_needed_components": "sekä varsinaisista moduulin sisältämistä lomakekomponenteista",
    "accessibility_list": {
      "point_1": "Multi-insert-suunnittelumalli vaatii erityistä huomiota fokuksen oikean siirtymisen suhteen. Fokuksen siirtyminen on kuvattu erikseen jäljempänä tällä sivulla.",
      "point_2": "On hyvä tuoda selkeällä tekstillä ilmi, että moduuleita (referenssitoteutuksessa verkkosivuja) voi lisätä useita.",
      "point_3": "Jokaisen moduulin yhteydessä olevaan poista-painikkeeseen tulee liittää ruudunlukijaa varten uniikki tieto siitä tiedosta, jota ollaan poistamassa. Referenssitoteutuksessa on esitetty, miten painikkeen aria-label muuttuu dynaamisesti moduulin tärkeimmän tietokentän arvon mukaan.",
      "point_4": "Moduulin poistamisen jälkeen näytetään ponnahdusilmoitus (toast), jolle on asetettu rooliksi alert. Tämän johdosta myös ruudunlukijakäyttäjät saavat tiedon poistamisesta.",
      "point_5": "Mikäli lomaketta tallennettaessa moduuleita on jäänyt kokonaan tyhjäksi, ei niitä huomioida, vaan ne poistetaan tallennetusta versiosta. Jos yksittäisiä pakollisia tietoja on jäänyt puuttumaan moduulin sisällä, ne indikoidaan tavalliseen tapaan komponenttien statustekstien avulla."
    },
    "components_text": "Malli rakentuu seuraavista komponenteista:",
    "focus": {
      "heading": "Fokuksen siirtäminen",
      "point_1": "Moduulia lisättäessä fokus siirtyy juuri lisätyn moduulin ensimmäiseen tietokenttään.",
      "point_2": "Moduulia poistettaessa",
      "point_2-1": "Mikäli moduuleita on vain yksi, fokus siirtyy \"Lisää uusi\" -painikkeeseen.",
      "point_2-2": "Mikäli moduuleita on useita ja muu kuin viimeinen moduuli poistetaan, fokus siirtyy seuraavan moduulin ensimmäiseen tietokenttään.",
      "point_2-3": "Mikäli moduuleita on useita ja viimeinen moduuli poistetaan, fokus siirtyy edellisen moduulin ensimmäiseen tietokenttään."
    },
    "reference_implementation": {
      "heading": "Referenssitoteutus",
      "paragraph": "Alta löydät käytettävyydeltään ja saavutettavuudeltaan hiotun interaktiivisen referenssitoteutuksen multi-insert-suunnittelumallista. Toteutuksen lähdekoodiin voi tutustua oheisesta linkistä.",
      "link_text": "Lähdekoodi GitHubissa",
      "add_at_least_one_website": "Lisää vähintään yksi verkkosivu",
      "named_website_removed": "Verkkosivu {{website_name}} poistettiin",
      "nameless_website_removed": "Nimetön verkkosivu poistettiin",
      "website": "Verkkosivu",
      "you_can_add_multiple_websites": "Voit lisätä useita verkkosivuja",
      "website_name": "Verkkosivun nimi",
      "website_name_hint_text": "Anna verkkosivulle kuvaava yleispätevä nimi",
      "website_name_placeholder": "Kirjoita verkkosivun nimi",
      "website_name_is_required": "Verkkosivun nimi on pakollinen tieto",
      "website_address": "Verkko-osoite",
      "website_address_hint_text": "Huolehdi, että verkko-osoitteen alussa on protokollatunniste https:// HUOM: Tee linkki aina verkkoasiointikanavan omaan osoitteeseen, ei esimerkiksi Suomi.fi-tunnistautumiseen.",
      "website_address_placeholder": "Kirjoita verkko-osoite",
      "website_address_is_required": "Verkko-osoite on pakollinen tieto",
      "website_description": "Kuvaus",
      "website_description_hint_text": "Anna tarvittaessa verkkosivua täsmentävä tieto",
      "website_description_placeholder": "Kirjoita kuvaus",
      "optional": "valinnainen",
      "remove_named_website": "Poista verkkosivu {{website_name}}",
      "remove_nameless_website": "Poista nimetön verkkosivu",
      "remove": "Poista",
      "add_new_website": "Lisää uusi verkkosivu"
    }
  },
  "styles": {
    "styles_usage_info": "Tyylien käyttöohje",
    "colors": "Värit",
    "icons": "Ikonit",
    "spacing": "Välistys"
  },
  "styles_main_page": {
    "ingress": "Design System tarjoaa Suomi.fi-identiteetin mukaisia tyylimäärittelyjä eli tokeneita. Design Systemiin kuuluvan komponenttikirjaston tyylit pohjautuvat näihin tokeneihin.",
    "paragraph_1": "Suomi.fi design tokenit löytyvät erillisenä pakettina yhdestä npm-moduulista. Niitä voi käyttää joko Javascript-muodossa (CSS-in-JS) tai SCSS-muodossa. Tokeneiden tarkempi käyttöohjeistus löytyy GitHub-dokumentaatiosta.",
    "style_usage": "Tyylitokeneiden käyttö",
    "style_usage_paragraph_1": "Tokeneita hyödyntämällä voi oman sivustonsa tyylit pitää linjassa Suomi.fi-teeman kanssa. Tokeneita voi käyttää suoraan omasta npm-moduulistaan kuten seuraavassa koodiesimerkissä.",
    "style_usage_paragraph_2": "Vaihtoehtoisesti tokenit ovat käytettävissä myös komponenttikirjaston teemaobjektin kautta alla olevan esimerkin mukaisesti.",
    "styled_element": "Tyylitelty elementti"
  },
  "colors": {
    "heading": "Värit",
    "ingress": "Suomi.fi-väriteeman pääväreihin kuuluu sininen (brandBase ja highlightBase), valkoinen (whiteBase) ja harmaa (depthBase). Tekstien päävärinä käytetään mustaa (blackBase). Korosteväreinä käytetään oranssia (accentBase) ja harmaan eri sävyjä. Yleisilme on vaalean neutraali, ja väriä käytetään harkiten korostamaan keskeisiä toimintoja ja sisältöjä.",
    "accessibility_list": {
      "point_1": "Kun käytät komponenttien tarjoamaa valmista Suomi.fi-väriteemaa käyttöohjeistuksien mukaisesti, täyttyvät saavutettavuuskriteeristön (WCAG) kontrastivaatimukset ja väriyhdistelmät ovat saavutettavuudeltaan riittäviä.",
      "point_2": "Jos haluat muokata värejä sopimaan erilaiseen visuaaliseen ilmeeseen, muista varmistaa, että valitsemasi väriyhdistelmien kontrastit täyttävät saavutettavuuskriteeristön (WCAG) asettamat vaatimukset.",
      "point_3": "Huomioi, että saavutettavuuskriteeristön (WCAG) kontrastivaatimukset eivät koske komponentteja, joiden käyttö on estetty. On kuitenkin tärkeää varmistaa, että estetty sävy eroaa kontrastiltaan tarpeeksi aktiivisen tilan väristä.",
      "point_4": "Tutustu näihin kohtiin tarkemmin saavutettavuuskriteeristön ohjeistuksessa: WCAG 2.1., onnistumiskriteeri 1.4.3 Kontrasti (minimi)."
    },
    "contrast_link": "WCAG 2.1 kontrastivaatimukset",
    "brand": {
      "heading": "Brändiväri",
      "paragraph": "Brändiväriä (brandBase) käytetään Suomi.fi-palveluiden logossa, alatunnisteessa sekä palveluiden yläreunan värillisessä palkissa."
    },
    "texts": {
      "heading": "Tekstit",
      "paragraph": "Tekstien pääväri on musta (blackBase). Mustaa käytetään myös joidenkin komponenttien yhteydessä olevissa ohjeteksteissä. Estetyissä (disabled) teksteissä käytetään vaalean harmaata (depthBase). Paikanvaraajanteksteissä käytetään tummanharmaata (depthDark2)."
    },
    "functionals": {
      "heading": "Linkit, painikkeet ja valinnat",
      "paragraph": "Sinistä (highlightBase) sekä siitä johdettuja vaalempia sävyä (highlightLight) käytetään interaktiivisissa elementeissä ja valittujen elementtien korostamisessa. Violettia (accentTertiaryDark1) käytetään linkkien vierailun jälkeisessä tilassa (visited state). Estetyissä tiloissa käytetään harmaata (depthBase). Sinisestä johdettua tummempaa sävyä (highlightDark1) käytetään esimerkiksi painikkeiden hovertilassa (hover state). Sinistä korostusväriä (accentSecondary) käytetään kaikkien komponenttien fokustilassa (focus state).    "
    },
    "icons": {
      "heading": "Ikonit",
      "paragraph": "Kuvitusikoneissa käytetään harmaata (depthBase) sekä oranssia (accentBase) korostevärinä. Toiminnallisissa ikoneissa käytetään toiminnallisten elementtien sinistä (highlightBase) väriä sekä tummaa harmaata (depthDark1)."
    },
    "borders": {
      "heading": "Taustat ja reunukset",
      "paragraph": "Sivun taustaväri on vaalean harmaa (depthLight3) ja sisältöalueen tausta on valkea (whiteBase). Reunuksien väri on harmaa (depthLight1). Lisäksi käytössä on sinisestä (highlightBase) väristä johdettuja sävyjä (highlightLight4, highlightLight3 ja highlightLight2) sekä haalea vaaleansininen (depthSecondary)."
    },
    "trafficlights": {
      "heading": "Liikennevalovärit",
      "paragraph": "Liikennevalovärit kuvaavat komponenttien, elementtien tai toimintojen tilatietoa. Vihreä (successBase) kuvaa onnistumista tai positiivista toimintoa. Keltainen (warningBase) kuvaa esim. tehtävää tai muuta asiaa, johon käyttäjän tulee reagoida. Punainen (alertBase) kuvaa virhetilaa tai häiriötä. Pelkkä väri ei riitä tiedon tai toiminnallisuuksien esittämiseen vaan tieto pitää esittää myös sanallisesti."
    },
    "accents": {
      "heading": "Korostevärit",
      "paragraph": "Korostevärejä käytetään tilanteissa, joissa väriä tarvitaan luomaan eroavaisuutta muista elementeistä."
    }
  },
  "icons": {
    "heading": "Ikonit",
    "ingress": "Tältä sivulla löydät kaikki Suomi.fi Design Systemin sisältämät ikonit. Ikonien käyttöohjeet löydät ikonikomponentin sivulta.",
    "icon_component_link_text": "Ikonikomponentti",
    "base_icons": {
      "title": "Perusikonit (base icons)",
      "link_title": "Perusikonit GitHubissa SVG-muodossa"
    },
    "illustrative_icons": {
      "title": "Kuvitusikonit (illustrative icons)",
      "link_title": "Kuvitusikonit GitHubissa SVG-muodossa"
    },
    "doctype_icons": {
      "title": "Liitetiedostoikonit (doctype icons)",
      "link_title": "Liitetiedostoikonit GitHubissa SVG-muodossa"
    }
  },
  "spacing": {
    "heading": "Välistys",
    "ingress": "Suomi.fi Design System sisältää valmiiksi määriteltyjä arvoja tilankäytölle. Näitä välistystokeneita käyttämällä verkkosivun asettelu pysyy yhtenäisenä ja harmonisena.",
    "paragraph_1": "Seuraavia välistyksiä käytetään sivulla olevien elementtien välisen tilan luomiseen.",
    "paragraph_2": "Design Systemiin kuuluvaa lohkokomponenttia voidaan käyttää tilan luomiseen hyödyntämällä sen marginaali- ja täyteominaisuuksia (padding).",
    "block_text_1": "Lohko, jossa on eri määrä tilaa (padding) eri reunoilla",
    "block_text_2": "Lohko, jolla on yläpuolen marginaalia",
    "inset_heading": "Inset-välistykset",
    "paragraph_3": "Inset-tokeneita käytetään komponenttien tai elementtien sisäisen välistyksen luomiseen."
  },
  "info": {
    "info": "Yleistä Design Systemistä",
    "accessibility": "Saavutettavuus"
  },
  "info_main_page": {
    "ingress": "Suomi.fi Design System tarjoaa kokoelman saavutettavia, uudelleenkäytettäviä ja dokumentoituja käyttöliittymäkomponentteja sekä ohjeistuksen niiden käyttöön. Design System -kirjaston komponentit ovat yhteismitallisia rakennuspalikoita, jotka auttavat niin suunnittelijoita kuin kehittäjiäkin toteuttamaan yhdenmukaisia palveluja. Voit hyödyntää komponentteja joko sellaisenaan tai muokata niiden ulkoasua vastaamaan oman palvelusi visuaalista ilmettä.",
    "ux_and_accessibility": {
      "heading": "Käyttäjäkokemus ja saavutettavuus",
      "paragraph_1": "Yhdenmukaisten käyttöliittymäkomponenttien avulla eri palvelut näyttäytyvät käyttäjille yhtenäisinä ja käyttäjäkokemus säilyy eheänä. Käyttämällä samanlaisia elementtejä johdonmukaisesti, tuotamme palvelun käyttäjälle intuitiivisen ja ymmärrettävän käyttökokemuksen. Yhdenmukaisesti toimivat palvelut ovat käyttäjien etu.",
      "paragraph_2": "Saavutettavuudesta huolehtiminen on erittäin keskeinen osa Suomi.fi Design System -kirjastoa. Kaikissa ratkaisuissa huomioidaan jo suunnitteluvaiheessa saavutettavuuskriteerit (WCAG 2.1). Apuvälinekäytön lisäksi suunnittelussa huomioidaan myös kognitiivinen saavutettavuus. Kaikki komponentit myös testataan saavutettavuusvaatimusten mukaisesti ennen niiden julkaisua."
    },
    "brand": {
      "heading": "Suomi.fi-brändi",
      "paragraph_1": "Kaikki Suomi.fi-kokonaisuuteen kuuluvat eri palvelut käyttävät Suomi.fi-brändiä, jota hallinnoi Digi- ja väestötietovirasto. Suomi.fi Design System -kirjaston käyttöliittymäkomponentit pohjautuvat Suomi.fi-brändin visuaaliseen ilmeeseen.",
      "paragraph_2": "Suomi.fi-brändiperheeseen kuuluu useita sähköisen asioinnin tukipalveluja. Näitä ovat esimerkiksi: Suomi.fi-verkkopalvelu, Palvelutietovaranto, Tunnistus, Viestit, Valtuudet, Kartat, Maksut, Palveluhallinta ja palveluväylän Liityntäkatalogi. Suomi.fi-logon käyttäminen palvelun tunnuksena on sallittua ainoastaan Suomi.fi-brändiperheeseen kuuluvissa palveluissa.",
      "paragraph_3": "Digi- ja väestötietoviraston uudet digitaaliset asiointipalvelut kansalaisille toteutetaan myös yhtenäisen Suomi.fi-käyttökokemuksen mukaisesti."
    },
    "ask_and_comment": {
      "heading": "Kysy ja kommentoi",
      "paragraph_1": "Kehittäjien ja komponenttikirjaston käyttäjien välinen keskustelu löytyy GitHubista.",
      "link_text": "GitHub"
    }
  },
  "accessibility_page": {
    "ingress": "Saavutettavuudella tarkoitetaan, että digitaaliset palvelut, verkkosivustot ja mobiilisovellukset sekä niiden sisällöt ovat sellaisia, että kuka tahansa voisi niitä käyttää ja ymmärtää, mitä niissä sanotaan. Verkkopalvelujen saavutettavuus koskee EU:n saavutettavuusdirektiivin ja sitä toteuttavan lain (Laki digitaalisten palvelujen tarjoamisesta) myötä koko julkista sektoria sekä osaa järjestöistä ja yrityksistä.",
    "paragraph_1": "Suomi.fi Design System -kirjaston avulla Digi- ja väestötietovirasto haluaa tukea ja edistää saavutettavien verkkopalvelujen rakentamista. Design Systemin -kirjastoon toteutettujen käyttöliittymäkomponenttien saavutettavuus varmistetaan sekä suunnittelu- että toteutusvaiheessa saavutettavuusasiantuntijan kanssa. Kaikki komponentit myös testataan ennen niiden julkaisua.",
    "paragraph_2": "Laki digitaalisten palvelujen tarjoamisesta astui voimaan 1.4.2019. Saavutettavuusvaatimusten pohjana toimii World Wide Web Consortiumin laatima verkkosisältöjen saavutettavuusohjeistus WCAG 2.1 (tasot A ja AA).",
    "link_1": "Laki digitaalisten palvelujen tarjoamisesta",
    "link_2": "EU:n saavutettavuusdirektiivi",
    "link_3": "WCAG 2.1 -ohjeistus",
    "multiple_factors": {
      "heading": "Saavutettavuus koostuu useista tekijöistä",
      "paragraph_1": "Saavutettavuusdirektiivi ja lainsäädäntö sisältävät ennen kaikkea määräyksiä teknisistä vaatimuksista, joilla parannetaan saavutettavuutta. Yhtä tärkeitä osatekijöitä hyvän saavutettavuuden toteuttamiseksi ovat visuaalisen ilmeen saavutettavuus, rakenteen saavutettavuus sekä sisältöjen ymmärrettävyys ja selkeys.",
      "paragraph_2": "Vaikka käyttöliittymäkomponentit itsessään olisivat saavutettavia, se ei kuitenkaan takaa, että palvelu kokonaisuudessaan on saavutettava. Suomi.fi Design Systemin komponenttikohtainen käyttöohjeistus auttaa käyttämään komponentteja oikein. On kuitenkin muistettava, että verkkopalvelun lopullinen kokonaisvaltainen saavutettavuus vaatii aina erillistä työtä, harkintaa ja testausta.",
      "paragraph_3": "Teknisen saavutettavuuden lisäksi tulee muistaa sisältöjen saavutettavuus (kognitiivinen saavutettavuus). Kognitiivinen saavutettavuus käsittää yhteisesti palvelussa esitettävän tiedon ja tavat, miten tieto esitetään käyttäjälle ymmärrettävästi. Sisältöjen ymmärrettävyys ja selkeys helpottavat jokaisen asiointia palvelussa. Koska kognitiivisia ominaisuuksia on vaikeampi mitata kuin teknisiä ominaisuuksia, on mahdollista, että digitaalinen palvelu ei ole helppokäyttöinen, vaikka palvelu täyttäisikin saavutettavuusvaatimukset.",
      "point_1": "Ymmärrettävyys tarkoittaa sitä, että palvelun sisällöt ja toiminta on esitetty käyttäjän ymmärtämällä tavalla. Käyttäjä siis käsittää, mitä hän on palvelussa tekemässä.",
      "point_2": "Palvelun sisältöjen osalta ymmärrettävyys tarkoittaa kielelliseen ilmaisuun liittyviä keinoja, joilla palvelun sisältö on käyttäjälle yksiselitteistä. Ymmärrettävyys tarkoittaa myös käyttöliittymässä käytettävien tekstien, erilaisten toimintojen ja palvelun logiikan kokonaisuutta. Tekstimuotoisen sisällön osalta ymmärrettävyys tarkoittaa lähtökohtaisesti selkeän ja hyvän yleiskielen käyttämistä.",
      "point_3": "Visuaalinen saavutettavuus tarkoittaa sitä, että palvelun käyttökokemus on johdonmukainen, käyttöliittymä on selkeä ja visuaalinen hierarkia tukee palvelun käytettävyyttä.",
      "point_4": "Digitaalisen palvelun toiminnan ja logiikan osalta ymmärrettävyys tarkoittaa erilaisia varmistuskeinoja, joilla käyttäjälle kerrotaan missä vaiheessa palvelua hän on ja miten hän pääsee liikkumaan palvelussa. Käyttäjälle myös kerrotaan eri toimintojen vaikutuksista ja hän ymmärtää eri toimintojen seuraukset ja yhtymäkohdat.",
      "link": "Lue lisää saavutettavuusvaatimuksista aluehallintoviraston sivuilta"
    }
  },
  "components": {
    "component_usage_info": "Komponenttien käyttöohje",
    "alert": "Alert (Heräte)",
    "block": "Block (Lohko)",
    "breadcrumb": "Breadcrumb (Murupolku)",
    "button": "Button (Painike)",
    "checkbox": "Checkbox (Valintaruutu)",
    "date_input": "Date input (Päivämääräkenttä)",
    "dropdown": "Dropdown (Pudotusvalikko)",
    "expander": "Expander (Laajennuspaneeli)",
    "heading": "Heading (Otsikko)",
    "hint_text": "Hint text (Ohjeteksti)",
    "icon": "Icons (Ikonit)",
    "label": "Label (Otsake)",
    "language_menu": "Language Menu (Kielivalikko)",
    "link": "Link (Linkki)",
    "loading_spinner": "LoadingSpinner (Latausindikaattori)",
    "modal": "Modal (Dialogi)",
    "multiselect": "MultiSelect (Monivalinta)",
    "notification": "Notification (Ilmoitus)",
    "pagination": "Pagination (Sivutus)",
    "radio_button": "Radio Button (Valintanappi)",
    "search_input": "Search Input (Hakukenttä)",
    "service_navigation": "Service navigation (Palvelunavigaatio)",
    "side_navigation": "Side navigation (Sivunavigaatio)",
    "singleselect": "Single Select (Yksittäisvalinta)",
    "text": "Text (Teksti)",
    "textarea": "Textarea (Tekstialue)",
    "text_input": "Text Input (Tekstikenttä)",
    "toast": "Toast (Ponnahdusilmoitus)",
    "toggle": "Toggle (Valintakytkin)",
    "tooltip": "Tooltip (Lisätieto)",
    "wizard_navigation": "Wizard navigation (Vaihenavigaatio)"
  },
  "components_main_page": {
    "ingress": "Suomi.fi Design System tarjoaa kokoelman saavutettavia, uudelleenkäytettäviä ja dokumentoituja käyttöliittymäkomponentteja. Komponentit on toteutettu Suomi.fi-identiteetin mukaisina React-komponentteina.",
    "text": "Komponenttikirjasto tarjoaa kaikki komponentit samasta npm-moduulista. Kirjaston tekninen ohjeistus ja käyttöönotto löytyy GitHub-dokumentaatiosta.",
    "link_text": "GitHub",
    "usage": {
      "title": "Komponenttien käyttö",
      "description": "Kirjastosta voi valita käyttöön haluamiaan komponentteja. Komponentit ovat avointa lähdekoodia.",
      "button_text": "Esimerkki"
    },
    "theme": {
      "title": "Teeman muokkaaminen",
      "description": "Kirjaston käyttämää oletusteemaa voi myös tarvittaessa muokata. Teeman muokkaaminen vaikuttaa kaikkiin muokatun teeman sisältämiin komponentteihin."
    },
    "advanced_usage": {
      "title": "Komponenttien vaativampi muokkaaminen",
      "description": "Jos komponentin tyylejä tarvitsee täydentää tai muokata se onnistuu usealla eri tavalla.",
      "button_styled": "Tyyli",
      "button_class": "Luokka nimi"
    }
  },

  "alert_page": {
    "site_title": "Alert (Heräte) | Suomi.fi Design System",
    "heading": "Alert (Heräte)",
    "ingress": "Heräte-komponentin avulla voidaan antaa käyttäjälle tietoa palvelun tilasta. Tällaista tietoa voi olla esimerkiksi häiriötilanteet tai ongelmat sivuston tai sen osan toiminnassa sekä tiedot tulevista käyttökatkoista.",
    "accessibility_list": {
      "point_1": "Käytä komponentista aina asiaankuuluvaa varianttia (Alert tai InlineAlert). Ks. 'Koko ja käyttö'.",
      "point_2": "Alert komponentti on myös semanttisesti alert, joka tarkoittaa, että sen sisällön muuttuessa komponentin sisältö luetaan välittömästi ruudunlukijakäyttäjille.",
      "point_3": "Sisältöherätteessä ruudunlukijakäyttäytyminen on säädettävissä, mutta sitä ei tule kytkeä kokonaan pois päältä.",
      "point_4": "Mikäli sisältöheräte liittyy selkeästi tiettyyn interaktiiviseen elementtiin sivulla, informoi yhteys myös ruudunlukijakäyttäjille käyttäen esimerkiksi 'aria-describedby' attribuuttia"
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text": "Heräte on jaettu kahteen eri komponenttiin (Alert ja InlineAlert). Komponentti koostuu herätteen tyyppiä kuvaavasta ikonista, sisältöalueesta sekä Alert komponentin tapauksessa 'sulje' -painikkeesta. Komponentin taustaväri sekä InlineAlert tapauksessa vasemman reunuksen väri muuttuu käytettävän herätetyypin mukaan."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Käyttötapa vaihtelee käytettävän komponentin mukaan. Alert komponenttia käytetään sivun pääsisällön ylälaidassa otsikon yläpuolella ilmaisemaan sivua tai sivustoa koskevia virhe- ja häiriötiedotteita. Alert komponenttia käytetään koko sisältöalueen levyisenä. Tulevia käyttökatkoja ilmaisemaan käytetään neutraalia varianttia, ja akuutteja häiriötilanteita varten 'error' varianttia.",
      "text_2": "InlineAlert komponenttia puolestaan käytetään sivun sisällön seassa toimintokohtaisiin ilmoituksiin ilmaisemaan esimerkiksi virhettä lomakkeen toiminnassa tai tärkeää lisäohjetta lomakkeen täyttämiseen liittyen."
    },

    "example": {
      "alert_info_paragraph": "Palvelussa käyttökatko ensi tiistaina 3:00 - 5:00 aamuyöllä",
      "inline_alert_heading": "Sisältöheräte (Inline Alert)",
      "inline_paragraph": "Sisältöherätettä käytetään sivun sisällön seassa ilmaisemaan huomioita, varoituksia tai virhetilanteita.",
      "inline_alert_info_heading": "Vahvista valtuus omalta osaltasi",
      "inline_alert_info_paragraph": "Vahvistamisen jälkeen muut vahvistajat näkevät Omat vahvistettavat -sivulla valtuuden, joka heidän tulee vahvistaa. Valtuus on voimassa vasta, kun kaikki ovat sen vahvistaneet.",
      "inline_alert_warning_paragraph": "Tekstissä on virheitä",
      "inline_alert_error_heading": "Allekirjoittaminen ei ole mahdollista",
      "inline_alert_error_paragraph": "Hakemusta ei voi allekirjoittaa henkilö, jonka ulkomaalainen henkilöasiakirja ei ole voimassa, koska hän ei voi todistaa henkilöllisyyttään.",
      "close_button": "Sulje"
    }
  },

  "block_page": {
    "site_title": "Block (Lohko) | Suomi.fi Design System",
    "heading": "Block (Lohko)",
    "ingress": "Lohko on sivun osiointiin tarkoitettu geneerinen alue, joka edesauttaa Suomi.fi Design Systemin mukaisten tyylien käyttöä.",
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Lohkoelementtiä käytetään sivun osiointiin ja se vastaa käyttötarkoitukseltaan esim. div, nav, header ja main HTML-elementtejä. Lohkoelementille semanttinen merkitys voidaan antaa parametrina.",
      "text_2": "Lohkoelementille voidaan myös antaa Suomi.fi tyylien mukaisia tyylimääreitä. Tyylit voidaan antaa komponentille suoraan parametreina, mikä poistaa tarpeen tyylien määrittelemiselle erikseen ja edesauttaa Suomi.fi Design Systemin mukaisten tyylien käyttöä. Lohkoelementti saa myös automaattisesti Suomi.fi tyylien mukaiset fonttimääreet."
    },
    "accessibility_list": {
      "point_1": "Käyttäessäsi lohkoelementtiä, määrittele sille osion semanttinen merkitys."
    }
  },

  "button_page": {
    "site_title": "Button (Painike) | Suomi.fi Design System",
    "heading": "Button (Painike)",
    "ingress": "Painike käynnistää toiminnon. Painiketta voidaan käyttää esimerkiksi siirtymiseen toiseen näkymään, tai painikkeella voidaan hyväksyä toiminto.",
    "accessibility_list": {
      "point_1": "Painike käynnistää yleensä toiminnon. Joissakin erityistapauksissa painiketta voidaan käyttää normaalin linkkityylin asemesta, kun käyttäjä ohjataan toiselle sivulle.",
      "point_2": "Painikkeet korostuvat helposti käyttöliittymässä ja siksi painikkeiden määrä sivulla kannattaa pitää rajallisena."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text": "Teksti kertoo painikkeen toiminnon. Toimintopainike kertoo vain olennaisen toiminnon, jonka se toteuttaa, esimerkiksi \"Valitse\" tai \"Seuraava\". Jos toimintopainikkeen nimi on yli kolme sanaa pitkä, mieti miten sitä voidaan lyhentää. Painikkeen teksti alkaa verbillä sekä aina isolla alkukirjaimella."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "description": "Mobiilikoossa käytetään täysleveää painiketta, joka skaalautuu näytön leveyden mukaan. Desktop-koossa käytetään kapeaa painiketta, joka skaalautuu painikkeen sisällön mukaan."
    },

    "example": {
      "primary": {
        "title": "Ensisijainen painike (Primary Button)",
        "description": "Ensisijaista painiketta käytetään, kun toiminto on ensisijainen, pakollinen tai olennainen prosessin tai muun toiminnon kannalta. Ensisijainen painike on yleisimmin käytetty painike. Painiketta käytetään erityisesti korostamaan pakollisia tai huomionarvoisia toimintoja, jotka ovat käyttäjälle keskeisiä. Usean ensisijaisen painikkeen käyttöä yhdessä näkymässä tulisi välttää.",
        "label": "Ensisijainen",
        "label_disabled": "Estetty ensisijainen"
      },

      "secondary": {
        "title": "Toissijainen painike (Secondary Button)",
        "description": "Toissijaista painiketta käytetään, jos painike ei ole olennainen esimerkiksi prosessin läpäisemisen kannalta tai toiminto on käyttäjän kannalta toissijainen. Jos toiminto ei ole pakollinen, esimerkiksi \"paluu edelliselle sivulle\" toimintapolussa (wizard), valitaan käyttöön toissijainen painike. ",
        "label": "Toissijainen ",
        "label_disabled": "Estetty toissijainen"
      },
      "link": {
        "title": "Linkkipainike (Link Button)",
        "description": "Linkkipainiketta käytetään tärkeän huomionarvoisen toiminnon esittämiseen, mutta toiminto ei ole käyttäjälle välttämättä pakollinen. Painiketta voidaan käyttää esimerkiksi taulukossa, jossa sama painike toistuu riveittäin.",
        "label": "Linkki",
        "label_disabled": "Estetty linkki"
      },
      "secondary_no_border": {
        "title": "Reunukseton painike (Borderless Button)",
        "description": "Reunuksetonta painiketta käytetään silloin, kun toiminnon huomioarvoa halutaan alentaa muihin nähden. Reunuksetonta painiketta voidaan käyttää toissijaisen painikkeen kaltaisesti esimerkiksi dialogin \"Keskeytä\"-painikkeena. Huomioi, että tekstipainikkeen taustaväri on oletuksena valkoinen, mutta on myös määriteltävissä käyttötapauksen mukaisesti.",
        "label": "Reunukseton painike",
        "label_disabled": "Estetty reunukseton painike"
      },
      "negative": {
        "title": "Käänteinen painike (Inverted Button)",
        "description": "Käänteistä painiketta käytetään erivärisillä taustoilla. Painikkeen käyttäminen kuvan päällä ei ole saavutettavuuden kannalta suositeltavaa. Jos painiketta käyttää kuvan tai kuvituksen päällä, tulee huomioida kuvan ja painikkeen välinen riittävä kontrasti.",
        "label": "Käänteinen",
        "label_disabled": "Estetty käänteinen"
      },
      "with_icon": {
        "title": "Painike ikonilla (Button with Icon)",
        "description": "Ikonillista painiketta käytetään selkeyttämään toimintoa tai erottamaan tärkeä toiminto muista painikkeista. Ikoni korostaa painikkeen roolia ja auttaa painikkeen tunnistamisessa. Kuvaava ikoni myös helpottaa ymmärtämään, mitä painikkeesta tapahtuu. Jos käytetään painiketta, jossa on pelkkä ikoni ilman visuaalista tekstiä, tuetaan saavutettavuutta käyttämällä aria-label attribuuttia. Tyypillinen esimerkki on sulje-painike (X), jolloin luettava nimi annetaan aria-label=\"Sulje\"."
      },
      "disabled": {
        "title": "Estetty painike (Disabled Button)",
        "description": "Estettyä painiketta käytetään silloin, kun toiminto ei ole jostain syystä klikattava. Painike voi olla estettynä esimerkiksi silloin, jos käyttäjä ei ole täyttänyt tarvittavia tietoja edetäkseen toiminnossa tai prosessissa eteenpäin. Estetty painike ei reagoi hover-toimintoon (hiiren kohdistimen siirtämistä painikkeen päälle). Vaikka estetty painike ei täytä saavutettavuuden kontrastivaatimusta, sitä on suositeltavaa käyttää, jos sen avulla voidaan parantaa käyttöliittymän ymmärrettävyyttä. Näin voidaan toimia, koska painikkeeseen ei kuitenkaan liity varsinaista toiminnallisuutta. "
      },

      "button": {
        "label_icon": "{{name}} ikoni vasen",
        "label_icon_right": "{{name}} ikoni oikea",
        "label_clicked": "{{name}}, painettu {{count}} kertaa"
      }
    }
  },

  "breadcrumb_page": {
    "site_title": "Breadcrumb (Murupolku) | Suomi.fi Design System",
    "heading": "Breadcrumb (Murupolku)",
    "ingress": "Murupolku on navigaatiokomponentti, joka esittää käyttäjälle näkymän sijainnin verkkopalvelun rakenteessa. Murupolun avulla käyttäjä voi liikkua verkkopalvelun sisältöhierarkiassa.",
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Murupolkukomponenttia käytetään, kun halutaan auttaa käyttäjää ymmärtämään, missä näkymä sijaitsee verkkopalvelun rakenteessa sekä missä kohtaa rakennetta käyttäjä parhaillaan on. Murupolku auttaa käyttäjää myös siirtymään tasolta toiselle verkkopalvelun sisältöhierarkiassa. Murupolut ovat hyödyllisiä erityisesti silloin, kun käyttäjä saapuu näkymään suoralla linkillä tai esimerkiksi hakukoneen kautta."
    },
    "accessibility_list": {
      "point_1": "Murupolun linkin nimen tulee olla sama kuin sen näkymän otsikko, johon linkki johtaa.",
      "point_2": "Murupolku on piilotettu käyttöliittymän mobiilikoossa, koska sivun asiasisältöä halutaan korostaa tuomalla se mahdollisimman lähelle sivun alkua. Lisäksi murupolun käyttäminen mobiilinäkymässä on asettelun ja motorisen käytettävyyden kannalta haastavaa.",
      "point_3": "Murupolku ei lisää käytettävyyttä ja saavutettavuutta sellaisissa verkkopalveluissa, joiden rakenne koostuu vain muutamista tasoista."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text": "Murupolku on linkkirivi, jossa näytetään avoinna olevan näkymän sijainti verkkopalvelun rakenteessa. Käyttäjän nykyinen sijainti esitetään linkkirivin viimeisenä. Nykyisen sijainnin tieto ei toimi linkkinä, ja se myös erotttuu visuaalisesti klikattavista linkeistä."
    },

    "in_ui": {
      "heading": "Murupolku käyttöliittymässä",
      "text": "Murupolku sijaitsee heti sivuston ylätunnisteen alapuolella."
    },
    "example": {
      "default": {
        "link1": "Etusivu",
        "link2": "Alasivu",
        "link3": "Alasivun alasivu"
      }
    }
  },

  "checkbox_page": {
    "site_title": "Checkbox (Valintaruutu) | Suomi.fi Design System",
    "heading": "Checkbox (Valintaruutu)",
    "ingress": "Valintaruutu on lomakekomponentti, jolla voidaan merkitä tarjottu vaihtoehto valituksi. Useasta valintaruudusta koostuvasta valintaruuturyhmästä käyttäjä voi valita useampia vaihtoehtoja.",
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Työpöytä- ja mobiilikäyttöön on määritelty erikseen omat koot valintaruudusta. Oletuksena käytetään pienempää valintaruutua (default), mobiilinäytöillä niille suunniteltua kokoa (large)."
    },
    "accessibility_list": {
      "point_1": "Pyri kuvaaviin, lyhyisiin ja ytimekkäisiin label-teksteihin.",
      "point_2": "Sijoita saman aihealueen valintaruudut ryhmiin asemoimalla ne päällekkäin.",
      "point_3": "Käytä valintaruutua, kun käyttäjän halutaan valitsevan vapaasti yhden tai useampia annetuista vaihtoehdoista.",
      "point_4": "Älä käytä valintaruutua tilanteissa, joissa käyttäjän on määrä valita ainoastaan yksi vaihtoehto. Käytä tällöin valintanappia (radiobutton).",
      "point_5": "Älä käytä valintaruutua tilan muutokseen. Käytä tähän tarkoitukseen valintakytkintä (toggle).",
      "point_6": "Käytä ohjetekstiä tilanteissa, joissa käyttäjälle on tarpeen antaa lisäohjeistusta valinnan suhteen. Yksinkertaisissa tapauksissa ohjetekstiä ei tarvita."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text": "Valintaruutu koostuu neliönmuotoisesta ruudusta ja sen oikealla puolella olevasta label-tekstistä. Valintaruudun alla voidaan näyttää valintaruutuun liittyvä ohjeteksti. Lisäksi on mahdollista näyttää ohjetekstin alla notifikaatioteksti, jolla voidaan viestiä käyttäjälle komponentin tilasta, esimerkiksi virheellisestä valinnasta. Notifikaatiotekstin lisäksi tilaa viestitään käyttäjälle myös värien sekä valintaruudun reunuksen paksuuden avulla. "
    },
    "example": {
      "default": {
        "title": "Tavallinen valintaruutu",
        "content": "Valinta"
      },
      "large": {
        "title": "Valintaruudun mobiiliversio",
        "description": "Mobiililaitteilla ja pienillä näytöillä käytetään valintaruudun mobiiliversiota (Checkbox.large)",
        "content": "Valinta"
      },
      "group": {
        "title": "Valintaruutu ryhmässä",
        "description": "Valintaruutu voidaan sijoittaa myös ryhmään (CheckboxGroup). Ryhmälle voidaan antaa tila, joka välitetään jokaiselle valintaruudulle ryhmän sisälle. Mikäli ryhmässä olevalle yksittäiselle valintaruudulle annetaan erikseen oma tila, se ajaa ryhmän antaman tilan ylitse. Ryhmän tilateksti ei välity yksittäisille valintaruuduille. Käytettäessä ryhmää, ei yksittäisille valintaruuduille tulisi antaa omaa tilatekstiä, sillä se saattaa sekoittaa käyttäjää.",
        "label": "Miten haluat, että sinuun otetaan yhteyttä",
        "hint": "Voit valita useamman kuin yhden",
        "status_text": "Valitse vähintään yksi",
        "content_label_email": "Sähköpostilla",
        "content_label_phone": "Puhelimella",
        "content_label_visit": "Henkilökohtaisella vierailulla"
      },
      "hintstate": {
        "title": "Ohje- ja notifikaatiotekstit",
        "description": "Komponentille voidaan antaa ohje- ja notifikaatiotekstit, jotka näytetään komponentin alla. Komponentin ja notifikaatiotekstin ulkonäkö muuttuu komponentin tilan (status) mukana.",
        "content": "Valinta",
        "hint_text": "Ohjeteksti valinnan tueksi",
        "status_text": "Notifikaatioteksti"
      },
      "disabled": {
        "title": "Estetty valintaruutu (Disabled Checkbox)",
        "description": "Estetty valintaruutu ei ole käyttäjän valittavissa. Estetty -tila voidaan poistaa esimerkiksi, kun käyttäjä suorittaa toisen vaadittavan toimenpiteen.",
        "content": "Valinta"
      }
    }
  },

  "date_input_page": {
    "site_title": "Date input (Päivämääräkenttä) | Suomi.fi Design System",
    "heading": "Date input (Päivämääräkenttä)",
    "ingress": "Päivämääräkenttä on komponentti, johon käyttäjä voi syöttää päivämäärätiedon valitsemalla sen kalenterista tai kirjoittamalla päivämäärän syöttökenttään. Päivämääräkenttä ohjaa käyttäjää syöttämään päivämäärän oikeassa muodossa muoto-ohjeen ja kalenterin avulla.",
    "accessibility_list": {
      "point_1": "Päivämääräkentän kanssa tulee käyttää otsaketta (label), joka kuvaa päivämääräkentän tarkoituksen. Otsake on osa päivämääräkomponenttia.",
      "point_2": "Käyttäjälle tulee esittää ohje päivämäärän muodosta. Ohjeen tulee olla aina näkyvissä joko ohjetekstissä tai otsakkeessa. Suositeltu paikka päivämäärän muoto-ohjeelle on komponentin ohjeteksti.",
      "point_3": "Muoto-ohjetta ei tule ilmoittaa ainoastaan päivämääräkentän placeholder-attribuutissa, koska tieto katoaa näkyvistä käyttäjän kirjoittaessa kenttään.",
      "point_4": "Kalenteria voi käyttää päivän valitsemiseen näppäimistön avulla. Focuksen siirtyminen pois kalenterin sisältä on estetty kalenterin ollessa auki."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Päivämääräkenttä koostuu otsakkeesta, tekstin syöttökentästä, sekä valinnaisesta kalenteristapainikkeesta. Päivämääräkenttään voidaan lisäksi antaa ohjeteksti, joka näkyy otsakkeen ja syöttökentän välissä. Päivämäärän muoto-ohje on suositeltava antaa ohjetekstinä.",
      "text_2": "Lomakkeessa olevat kentät ovat oletusarvoisesti pakollisia, ja valinnaiset kentät ilmoitetaan valinnaisuustekstillä. Valinnaisuusteksti näytetään suluissa otsakkeen lopussa. Päivämääräkentälle voidaan lisäksi antaa tila ja tilateksi, jotka ilmaisevat hyväksyttyä tai virheellistä tilaa.",
      "text_3": "Kalenteripainike avaa dialogin, josta käyttäjä voi valita päivämäärän kalenterinäkymässä."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Käyttäjälle tulee aina antaa mahdollisuus kirjoittaa päivämäärä suoraan tekstin syöttökenttään. Päivämäärän valinta kalenterinäkymästä on käyttäjälle valinnainen toiminto. Selkeissä päivämäärävalinnoissa, kuten syntymäpäivässä, on hyvä käyttää pelkkää syöttökenttää. Kalenteri helpottaa päivämäärän valintaa silloin, kun halutaan nähdä päivämäärä suhteessa viikonpäiviin.",
      "text_2": "Päivämääräkenttää ei tule käyttää yksittäisen kuukausi-, vuosi- tai kellonaikatiedon valitsemiseen. Näissä tapauksissa voidaan käyttää päivämääräkentän sijaan esimerkiksi alasvetovalikkoa.",
      "text_3": "Päivämääräkenttä sisältää kalenterista versiot työpöytäkäyttöön ja mobiilikäyttöön. Oletusarvoisesti käytössä on työpöytäversio, joka avaa kalenterin joko syöttökentän ala- ta yläpuolelle käytettävissä olevan tilan mukaan. Mobiilikäyttöön tarkoitettu versio avaa kalenterin selaimen alalaitaan.",
      "text_4": "Kalenterinäkymä tukee erilaisia näppäimistön pikakomentoja kuukausien ja vuosien välillä liikkumiseen. Lisäksi kalenterin mobiiliversio tukee pyyhkäisyeleitä edelliseen ja seuraavaan kuukauteen siirtymiseen."
    },
    "shortcuts": {
      "shortcut_1_description": "Siirry päivien välillä käyttämällä nuolinäppäimiä",
      "shortcut_2_description": "Siirry viikon alkuun painikkeella ",
      "shortcut_3_description": " ja viikon loppuun painikkeella ",
      "shortcut_4_description": "Siirry kuukausi taaksepäin painikkeella ",
      "shortcut_5_description": " ja kuukausi eteenpäin painikkeella ",
      "shortcut_6_description": "Siirry edelliseen vuoteen painikkeilla ",
      "shortcut_7_description": " ja seuraavaan vuoteen painikkeilla "
    },
    "example": {
      "common": {
        "label": "Ajastettu julkaisupäivä",
        "hint_text": "Kirjoita muodossa PP.KK.VVVV. Ajastettu sisältö julkaistaan julkaisupäivänä."
      },
      "error": {
        "title": "Virheellinen päivämääräkenttä",
        "status_text": "Vaadittu tieto"
      },
      "optional": {
        "title": "Valinnainen päivämääräkenttä",
        "optional_text": "valinnainen"
      },
      "smallscreen": {
        "title": "Kalenterin mobiiliversio"
      }
    }
  },

  "dropdown_page": {
    "site_title": "Dropdown (Pudotusvalikko) | Suomi.fi Design System",
    "heading": "Dropdown (Pudotusvalikko)",
    "ingress": "Pudotusvalikko kokoaa sisältölistan monesta valittavasta vaihtoehdosta joista käyttäjä voi valita yhden. Pudotusvalikosta voidaan myös aktivoida toimintoja.",
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Pudotusvalikko säästää tilaa käyttöliittymässä sekä vähentää valinta- ja tekstinsyöttövirheitä tarjoamalla käyttäjälle listan valmiiksi valituista vaihtoehdoista. Pudotusvalikkon avulla käyttäjä valitsee listasta yhden vaihtoehdon. Pudotusvalikolle voidaan antaa oletusarvo tai näyttää oletuksena haluttu täyteteksti (visual placeholder) valikkopainikkeessa. Täyteteksti katoaa käyttäjän tehtyä valinnan."
    },
    "accessibility_list": {
      "point_1": "Huomioi pudotusvalikon asettamat mahdolliset kognitiiviset saavutettavuushaasteet. Käytä komponenttia harkiten ja mieti tarkoin pudotusvalikon sisältö.",
      "point_2": "Yhdellä silmäyksellä hahmotettava valintalista tukee kognitiivista saavutettavuutta. Mieti, olisiko pudotusvalikon yhteydessä mahdollista tarjota edeltävä rajaus, joka vähentäisi pudotusvalikon valintavaihtoehtoja.",
      "point_3": "Pyri välttämään kaiken ylimääräisen lisäinformaation esittämistä pudotusvalikon yhteydessä.",
      "point_4": "Jos valintavaihtoehtoja on vain muutama, hyvä vaihtoehto pudotusvalikolle voi olla valintaruutu- tai valintanappikomponentti.",
      "point_5": "Järjestä pudotusvalikon sisältö aakkosjärjestykseen tai relevanssin mukaan.",
      "point_6": "Pudotusvalikon yhteydessä tulee aina käyttää otsaketta (label)",
      "point_7": "Ruudunlukijat eivät lue täytetekstiä (visual placeholder). Täyteteksti myös katoaa käyttäjän tehtyä valinnan, joten sitä ei tule käyttää ohjeistukseen"
    },

    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text": "Pudotusvalikko koostuu otsakkeesta, valikkopainikkeesta sekä valikosta, joka aukeaa valikkopainiketta painamalla. Pudostusvalikon otsake (label) ilmaisee selkeästi ja lyhyesti mitä pudotusvalikko sisältää. Kun käyttäjä tekee valinnan, valikko sulkeutuu ja valittu arvo näkyy valikkopainikkeessa. "
    },

    "example": {
      "label": "Seurantajakso",
      "placeholder": "Valitse seurantajakso",
      "option1": "7 vrk",
      "option2": "30 vrk",
      "option3": "6 kk",
      "option4": "Vuosi",
      "example1": {
        "title": "Toimintovalikko (Action Menu)",
        "description": "Pudotusvalikkoa voidaan käyttää myös toimintojen aktivoimiseen, jolloin komponenttia kutsutaan toimintovalikoksi. Tällöin annettu täyteteksti on aina näkyvissä eivätkä tehdyt valinnat muuta komponentin tilaa.",
        "label": "Valitse toiminto",
        "placeholder": "Toimintovalikko",
        "option1": "Toiminto 1",
        "option2": "Toiminto 2"
      }
    }
  },

  "expander_page": {
    "site_title": "Expander (Laajennuspaneeli)| Suomi.fi Design System",
    "heading": "Expander (Laajennuspaneeli)",
    "ingress": "Laajennuspaneeli piilottaa näkyvistä otsikon alle määriteltyä informaatiota tai sisältöä. Laajennuspaneeli helpottaa käyttäjää hahmottamaan sellaisia näkymiä, jossa on laajasti sisältöä. Komponenttia käytetään, kun tilaa on pystysuunnassa rajoitetusti. Komponentin avulla sivun pituutta voidaan lyhentää.",
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Käytä laajennuspaneelia ainoastaan sisällölle, jonka ei ole välttämätöntä olla käyttäjälle näkyvissä koko ajan. Laajennuspaneelia voidaan myös käyttää vähemmän tärkeälle sisällölle."
    },
    "accessibility_list": {
      "point_1": "Laajennuspaneelien käytössä tulee erityisesti huomioida kognitiivinen saavutettavuus, koska laajennuspaneeli piilottaa osan sisällöstä. Käyttäjät eivät välttämättä huomaa paneelikomponentin olemassaoloa tai eivät ymmärrä, miten komponenttia tulisi käyttää.",
      "point_2": "Ensisijaisesti kannattaa miettiä, voiko sisältöä ryhmitellä, lyhentää tai jakaa niin, että sisältö on hallittavissa ilman laajennuspaneelin käyttämistä.",
      "point_3": "Laajennuspaneelia tulee käyttää vain, jos sisältöä on erityisen paljon ja käytettävyyden kannalta on perusteltua lyhentää sivun pituutta erillisiin paneeliosioihin.",
      "point_4": "Laajennuspaneelia ei tule mielellään käyttää sellaisissa tapauksissa, joissa sisältö on olennaista käyttäjille.",
      "point_5": "Liian pitkien laajennuspaneelien kokonaisuuksia tulisi välttää.",
      "point_6": "Suomi.fi:ssa laajennuspaneelia on käytetty silloin, kun sisältöosuus on erityisen pitkä. Tällä tuetaan kokonaisuuden hahmottamista."
    },

    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text": "Laajennuspaneelissa on otsikko ja sisältöalue. Otsikko tiivistää sisällön ja se voidaan ilmaista myös kysymysmuodossa. Laajennuspaneelin sisältöalue kertoo otsikon aiheesta tarkemmin. Mikäli yksittäisen laajennuspaeneelin sisältö on erityisen laaja, sisältöalueella voidaan käyttää toista tarkentavaa ja sisältöä ryhmittävää otsikkoa."
    },

    "example": {
      "expander": {
        "title": "Laajennuspaneeli",
        "content": "Laajennuspaneelin sisältö"
      },

      "nopadding": {
        "description": "Laajennuspaneelin sisällössä on oletusarvoisesti täytettä (padding). Tämä voidaan poistaa \"noPadding\" attribuutilla, mikäli oma tyylitys sen vaatii."
      },
      "single": {
        "title": "Yksittäinen laajennuspaneeli (Single Expander)",
        "description": "Yksittäistä laajennuspaneelia käytetään, kun on tarvetta on ainoastaan yhdelle paneelille, esimerkiksi sisältökokonaisuudessa toistuvalle tietosisällölle. "
      },
      "group": {
        "title": "Laajennuspaneeliryhmä (Expander Group)",
        "description": "Laajennuspaneeliryhmä koostuu useasta (kaksi tai useampi) päällekkäisestä yksittäisestä laajennuspaneelista. Laajennuspaneeliryhmä liittyy yhteen sisältökokonaisuuteen. Sivunäkymässä voi olla monta erillistä laajennuspaneeliryhmää, jotka on selkeästi eritelty toisistaan alaotsikoita hyödyntäen. Yksittäisen laajennuspaneeliryhmän yläkulmassa on \"Avaa kaikki\" toiminto, jonka avulla kaikki ryhmän paneelit saa halutessaan auki. Auki ollessa toiminto muuttuu muotoon \"Sulje kaikki\", jonka avulla kaikki ryhmän paneelit saa kiinni. Toiminto helpottaa käyttäjää pääsemään käsiksi heti koko sisältöön ja se myös parantaa paneelien sisällä olevasta sisällöstä etsimistä.",
        "open": "Avaa kaikki",
        "close": "Sulje kaikki"
      }
    }
  },

  "heading_page": {
    "site_title": "Heading (Otsikko)| Suomi.fi Design System",
    "heading": "Heading (Otsikko)",
    "ingress": "Otsikot auttavat luomaan sivun sisällölle selkeän rakenteen, jonka avulla käyttäjä muodostaa kokonaiskäsityksen sivun sisällöstä.",
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Otsikoiden koot on määritelty erikseen sekä desktop- että mobiilinäytöille. Otsikot vaihtuvat normaalikoosta (Normal) pieneen kokoon (Small). Small-tyyppiset otsikkotyylit on määritelty erikokoisiksi kaikille muille otsikoille paitsi h5-otsikolle. Etusivun pääotsikolle on määritelty myös erillinen Hero-tyyli, jota käytetään erottamaan otsikkotyyli muiden sivujen pääotsikoista."
    },
    "accessibility_list": {
      "point_1": "Kuten näkevä käyttäjä, ruudunlukijakäyttäjäkin muodostaa kokonaiskäsityksen sisällöstä otsikoiden perusteella.",
      "point_2": "Otsikointihierarkian tulee olla yhtenäinen (h1, h2, h3, h4, h5), eikä välistä saa puuttua otsikkotasoja. Oikea otsikkotasojen hierarkia tukee rakenteen hahmottamista.",
      "point_3": "Otsikkotasojen puuttuminen välistä tai otsikkotasojen epäjärjestys vaikeuttaa sisällön hahmottamista ruudunlukijaa käytettäessä. Ruudunlukija tulkitsee vain heading-merkityt komponentit otsikoiksi.",
      "point_4": "Huomioi tekstiä koskevat saavutettavuusohjeistukset (WCAG 2.1): 1.4.3 Kontrasti (minimi), 1.4.4 Tekstin koon muuttaminen, 1.4.12 Tekstin välistys."
    },

    "link_1": "Verkkosisällön saavutettavuusohjeet (WCAG) 2.1",
    "link_2": "Lisätietoa typografiamäärittelyistä Tyylit-osiosta",

    "example": {
      "title": "Suomi.fi-teeman tukemat otsikkotyylit"
    }
  },

  "icon_page": {
    "site_title": "Icons (Ikonit)| Suomi.fi Design System",
    "heading": "Icons (Ikonit)",
    "ingress": "Ikonit ovat visuaalisia symboleja, jotka tukevat toimintojen ja aiheiden ilmaisemista. Ikonien avulla käyttäjän huomiota voidaan kiinnittää haluttuun informaatioon tai toimintoon. Ikonien käyttäminen voi myös parantaa laajojen sisältöjen hahmottamista ja ryhmittämistä. Suomi.fi-teemassa on sekä käyttöliittymäikoneita että kuvitusikoneita.",
    "all_icons_page_link_title": "Katso kaikki Suomi.fi-ikonit",
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Jos ikoneita käytetään tekstin yhteydessä, tekstin koko määrittelee ikonin koon."
    },
    "accessibility_list": {
      "point_1": "Jos ikoni on informatiivinen tai toiminnallinen, kuvalle on luotava tekstivastine käyttämällä WAI-ARIA-määritettä \"aria-label\" tai \"aria-labelledby\".",
      "point_2": "Jos ikoni on tarkoitettu vain visuaaliseksi tehosteeksi, käytetään sitä varten WAI-ARIA-määritettä role='presentation' (ei role='img'). Tällöin avustavat tekniikat ohittavat kuvan.",
      "point_3": "Kuvitusikonien käytössä tulee huomioida ikonille looginen käyttötarkoitus. Jos ikoni on ristiriidassa sisällön kanssa, tämä voi heikentää käytettävyyttä ja kognitiivista saavutettavuutta.",
      "point_4": "Ikonit ovat harvoin yksiselitteisiä kaikille käyttäjille. Ikoni esitetään siksi yleensä tekstin kanssa, jolloin käyttäjän ymmärrys ei jää pelkän ikonin varaan. Poikkeuksena info-ikoni, jonka käyttö on yleisesti vakiintunut."
    },

    "basic_icons": {
      "title": "Perusikonit",
      "description": "Perusikonien oletusväri on harmaa (depthDark1). Jos ikonissa on mukana jokin toiminto, siinä käytetään sinistä väriä (highlightBase) klikattavuuden indikoimiseksi. Notifikaatioikoneissa käytetään liikennevalovärejä (successBase, warningBase, alertBase) sekä sinistä korosteväriä (accentSecondaryBase). Huomaa, että värit ovat ikoneissa ainoastaan hahmottamisen tukena. Pelkkä visuaalinen korostus ei ole saavutettavuuskriteereiden mukainen riittävä toiminnan kuvaustapa. Jos muokkaat ikonien värityksiä, on hyvä valita toimintaa kuvaaville ikoneille muista ikoneista erottuva sävy.",
      "example_arialabel": "Checkmark-ikoni"
    },

    "info_icons": {
      "title": "Ohjeikoni",
      "description": "Ohjeet ovat esim. käyttöliittymässä näytettäviä kontekstiohjeita, joita käyttäjä tarvitsee tietääkseen mitä tehdä tai miten toimia. Ikonin taakse piilotettujen ohjeiden lukeminen ei ole milloinkaan välttämätöntä. Suomi.fi-teemassa ohjeikoni on sininen (highlightBase) ja tummalla taustalla käytetään valkoista (whiteBase) ikonia. Ohjeikonista on Suomi.fi-teemassa kaksi erillistä versiota, täytetty versio sekä ääriviivaversio. Täytettyä ohjeikonia käytetään silloin, kun sitä klikkaamalla käyttäjälle aukeaa/tarjotaan lisää ohjeistusta. Ääriviivaversiota ohjeikonista käytetään visuaalisena tukena. Ohjeikonilla ei ole selittävää tekstiä, koska teksti häiritsisi varsinaisen sisällön lukemista. Ohjeikoni on ikoneista helpoiten ymmärrettävä, ja siksi se toimii myös ilman selittävää tekstiä.",
      "example1_arialabel": "Kysymysmerkki-ikoni tummalla pohjalla",
      "example2_arialabel": "Kysymysmerkki-ikoni vaalealla pohjalla"
    },

    "additional_info_icons": {
      "title": "Lisätietoikoni",
      "description": "Lisätieto on asiaa, jonka käyttäjän täytyy lukea ja ymmärtää toimiakseen oikein. Lisätietoikoni on huomioarvoltaan suurempi kuin ohjeikoni. Tummalla pohjalla käytetään valkoista (whiteBase) ikonia. Lisätietoikonista on Suomi.fi-teemassa kaksi erillistä versiota, täytetty sekä ääriviivaversio. Täytettyä lisätietoikonia käytetään silloin, kun sitä klikkaamalla käyttäjälle aukeaa lisätietoa. Ääriviivaversio lisätietoikonista käytetään visuaalisena tukena esimerkiksi modaaleissa.",
      "example1_arialabel": "Tumma ympyrän muotoinen huomioikoni",
      "example2_arialabel": "Informaatioikoni vaalealla pohjalla"
    },
    "illustrative_icons": {
      "title": "Kuvitusikonit",
      "description": "Kuvitusikonit kuvaavat sisällössä esitettäviä elämäntilanteita ja aihealueita. Ikoneissa käytetyt värit ovat vaaleanharmaa (depthBase) ja oranssi (accentBase). Myös kuvitusikonit pyritään pitämään yksinkertaisina, jotta vältyttäisiin luomasta ylimääräistä kognitiivista rasitetta. Suomi.fi-palveluissa jokaisella kuvitusikonilla on teema, joka antaa osviittaa käyttötarkoituksesta.",
      "example_arialabel": "Neljä kättä pitävät toisistaan kiinni"
    },
    "attachment_icons": {
      "title": "Liitetiedostoikonit",
      "description": "",
      "example_arialabel": "Tekstitiedostoikoni"
    },

    "sign_language_icons": {
      "title": "Viittomakielipalvelut",
      "description": "Suomi.fi-verkkopalveluissa käytetään Kuurojen liiton viittomakielen palveluiden symbolia.",
      "link_title": "Viittomakielen ikoni Kuurojen liiton sivulla",
      "example_arialabel": "Viittomakielen ikoni"
    }
  },

  "language_menu_page": {
    "site_title": "Language Menu (Kielivalikko) | Suomi.fi Design System",
    "heading": "Language Menu (Kielivalikko)",
    "ingress": "Kielivalikkoa käytetään, kun palvelua voidaan käyttää useilla kielillä, eli sillä on useita kieliversioita. Kielen vaihtaminen vaihtaa käyttöliittymässä käytetyn kielen.",
    "accessibility_list": {
      "point_1": "Suomi.fi kielivalintakomponentissa otsake (label) on rakennettu komponenttiin, mutta teksti on visuaalisesti piilotettu näkyvistä tyylisyistä. Otsakkeen (label) käyttäminen pudotusvalikon yhteydessä on muuten aina suositeltavaa.",
      "point_2": "Huomioi, että viittomakieli ei ole kielivalinta vastaavasti kuin puhutut kielet, joten käyttäjää ei ohjata viittomakielisiin sisältöihin kielivalikosta. Suomi.fi palvelussa ohjataan viittomakielisiin sisältöihin etusivun nostolaatikosta, alatunnisteesta, sekä hakusivun kautta."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text": "Kielivalikossa näkyy palvelun eri kieliversiot. Suomi.fi verkkopalvelussa vaihtoehdot ovat suomi, ruotsi ja englanti."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Klikkaamalla avautuu kielivalintamahdollisuudet ja valitsemalla haluttu kieli, Suomi.fi palvelu muuttuu valitulle kielelle."
    },

    "in_ui": {
      "heading": "Kielivalikko käyttöliittymässä",
      "text": "Kielivalikko kannattaa sijoittaa sivuston tai palvelun ylätunnisteeseen (Header). Suomi.fi palvelussa kielivalikko sijaitsee ylätunnisteessa (Header). Pienillä näytöillä kielivalintaan käytetään linkkejä, jotka sijoitetaan osaksi navigointiin käytettävää valikkoa."
    },

    "example": {
      "menuitem1": "Suomeksi (FI)",
      "menuitem1short": "FI",
      "menuitem2": "På Svenska (SV)",
      "menuitem2short": "SV",
      "menuitem3": "In English (EN)",
      "menuitem3short": "EN"
    }
  },

  "link_page": {
    "site_title": "Link (Linkki) | Suomi.fi Design System",
    "heading": "Link (Linkki)",
    "ingress": "Linkkiä käytetään pääsääntöisesti navigaatioelementtinä.",
    "accessibility_list": {
      "point_1": "Linkin tulee olla kuvaava ja sen tarkoituksen ymmärrettävissä pelkästä linkin nimestä.",
      "point_2": "Linkin nimen on hyvä vastata sen sivun otsikkoa, jonne linkki käyttäjän ohjaa.",
      "point_3": "Vältä yleisluontoisia \"Lue lisää\"-tyyppisiä linkkejä. Jos linkki kuitenkin halutaan esittää yleisluontoisena, voidaan ruudunlukijaa varten lisätä Aria-teknologialla lisätieto kohdesivusta tyyliin: \"Lue lisää aiheesta Vanhemmuuden tuki\".",
      "point_4": "Linkkityylin tulee olla yhtenäinen. Suomi.fi Design Systemissä päädyttiin kuitenkin selkeyden vuoksi esittämään leipätekstin ulkopuoliset linkit ilman alleviivausta, koska jokaisen kohdan alleviivaus teki listoista vaikealukuisia. Poikkeuksena tähän luetaan myös navigaatiot, joissa ei käytetä linkkityylejä.",
      "point_5": "Yleensä heading-luokituksen mukainen otsikko ei ole linkki, vaan linkki esitetään erillisenä komponenttina. Poikkeuksena kuitenkin listaukset, jolloin linkin toistaminen jokaisen yksikön yhteydessä lisäisi listauksen pituutta.",
      "point_6": "Vältä saman linkin toistumista näkymässä samalla tai eri nimellä.",
      "point_7": "Mikäli linkki avaa tiedoston tai ohjaa käyttäjän pois sivustolta, täytyy tämän tiedon olla linkin yhteydessä sekä näkeville ja ruudunlukijakäyttäjille."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Linkkien väri on Suomi.fi-teemassa on sininen (highlightBase). Jos linkki on estetty, käytetään harmaata (depthBase). Suomi.fi Design Systemissä linkit on esitetty ilman alleviivausta, mutta hover-tilassa (hiiren kohdistimen siirtämisessä painikkeen päälle) linkki on alleviivattu. Leipätekstin joukossa linkkitekstit alleviivataan, jotta ne erottuvat muusta tekstistä. Alleviivatut linkit ovat hover-tilassa ilman alleviivausta.",
      "text_2": "Vierailun jälkeisessä tilassa (visited state) linkin väri on violetti (accentTertiaryDark1). Tila indikoidaan kaikissa linkeissä lukuunottamatta päänavigaation linkkejä ja käänteisiä linkkejä. Huomioi, että jos muokkaat linkkien tilojen värejä, on hyvä valita värit, jotka erottuvat riittävästi toisistaan. Linkeissä ei ole välttämätöntä käyttää vierailun jälkeiselle tilalle eri väriä, mutta sen käytön on todettu parantavan huomattavasti tekstiä sisältävien näkymien luettavuutta. Lisäksi näin pystytään indikoimaan selkeämmin listanäkymissä käyttäjän jo vierailemat sivut."
    },
    "size_and_usage": {
      "heading": "Komponentin koko, käyttö ja variaatiot",
      "text_1": "Linkit eroavat painikkeista siinä, että ne eivät muokkaa tietoa tai käynnistä toimintoa. Linkit vievät käyttäjän uuteen paikkaan käyttöliittymässä tai kokonaan pois sivustolta (External Link)."
    },

    "in_ui": {
      "heading": "Komponentti käyttöliittymässä",
      "text_1": "Suomi.fi-palveluissa käytetään eri käyttötarkoituksiin erilaisia variaatioita linkistä."
    },

    "example": {
      "regular": {
        "title": "Linkki (Link)",
        "description": "Kirjasinkoko ja leikkaus on tasapainossa muun sisällön kanssa.",
        "link_text": "Esimerkkilinkki"
      },
      "external": {
        "title": "Ulkoinen linkki (External link)",
        "description": "Ulkoiset linkit ovat linkkejä, jotka ohjaavat käyttäjän pois sivustolta. Ulkoiset linkit avataan uuteen välilehteen/ikkunaan. Linkeissä käytetään aina ulkoisen linkin symboloivaa ikonia sekä ruudunlukijakäyttäjille myös sanallista tietoa \"Avautuu uuteen ikkunaan\". ",
        "link_text": "Ulkoinen linkki",
        "label": "Avautuu uuteen ikkunaan"
      }
    }
  },

  "loading_spinner_page": {
    "site_title": "LoadingSpinner (Latausindikaattori) | Suomi.fi Design System",
    "heading": "LoadingSpinner (Latausindikaattori)",
    "ingress": "Latausindikaattori on varsinaisen sisällön tilalla esitettävä latauksen ilmaisin, joka kertoo käyttäjälle näkymän, sen osan, tai muun taustalle käynnistetyn latausprosessin tilasta. Komponentilla voidaan ilmaista latauksen käynnissä oleminen sekä tarvittaessa latauksen valmistuminen tai epäonnistuminen. ",
    "accessibility_list": {
      "point_1": "Latausindikaattoria tulee käyttää vain jos latausaika kestää yli sekunnin. Nopeasti näytöllä vilahtava animaatio on häiritsevä, koska käyttäjä ei ehdi havaitsemaan sitä kunnolla.",
      "point_2": "Jos tiedetään, että latausaika kestää yli 10 sekuntia, tilatekstin tulisi sisältää tarkempi tieto latauksen edistymisestä. Esimerkiksi \"17 / 1024 valmiina\" tai \"57 % valmiina\".",
      "point_3": "Hyvä tilateksti on selkeä ja ytimekäs, ja sen tulee sisältää riittävästi informaatiota, jotta myös ruudunlukijakäyttäjät saavat tiedon latauksen tilasta.",
      "point_4": "Saavutettavuuden osalta toteutuksessa on huomioitava, että tieto indikaattorin tilamuutoksista ja ladattavan sisällön valmistumisesta, tai latauksen epäonnistumisesta välitetään ruudunlukijalle. Vaikka tilateksti piilotettaisiin näkyvistä, tulee sen olla kuvaava ja selkeä ruudunlukijakäyttäjiä varten.",
      "point_5": "Erityisesti nopeasti tapahtuvan latauksen edistymistietoja, kuten valmistumisprosenttia, ei tarvitse välittää ruudunlukijalle. Tällöin mahdollisesti käytössä olevalle aria-live osiolle tulee latauksen ajaksi asettaa aria-busy attribuutti. Latauksen valmistuminen tai mahdollinen epäonnistuminen tulee tässäkin tapauksessa viestiä myös ruudunlukijakäyttäjille."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "LoadingSpinner koostuu ikonista ja tilatekstistä. Ikoni on tilasta riippuen animoitu tai staattinen. Tilateksti sijaitsee ikonin ala- tai oikealla puolella, ja se on mahdollista piilottaa näkeviltä käyttäjiltä tarvittaessa.",
      "text_2": {
        "heading": "Komponentilla on kolme havaittavaa tilaa:",
        "state1": "lataus on käynnissä",
        "state2": "lataus epäonnistui",
        "state3": "lataus valmistui onnistuneesti"
      }
    },
    "size_and_usage": {
      "heading": "Komponentin koko, käyttö ja variaatiot",
      "text_1": "Latauksen käynnistyessä latausindikaattori tuodaan näkyviin käyttöliittymään siihen kohtaan, jossa varsinainen sisältö on tarkoitus esittää. Latauksen etenemistä ilmaistaan animaatiolla ja tilatekstillä (esimerkiksi latauksen prosentuaalinen edistyminen). Latauksen valmistuessa latausindikaattori katoaa käyttöliittymästä ja korvautuu varsinaisella sisällöllä automaattisesti.",
      "text_2": "Latausindikaattori voi koskea koko näkymää, tai sen osaa ja se näytetään käyttöliittymässä siinä kohdassa, jossa ladattava sisältö sijaitsee."
    },

    "example": {
      "basic": {
        "heading": "Normaali käyttötapaus",
        "description": "Latauksen päätyttyä indikaattori poistuu näkyvistä."
      },
      "success": {
        "heading": "Onnistumista indikoiva tila",
        "description": "Tässä esimerkissä lataus valmistuu onnistuneesti."
      },
      "error": {
        "heading": "Epäonnistumista indikoiva tila",
        "description": "Tässä esimerkissä lataus päättyy epäonnistumiseen."
      },
      "close_button": "Palauta alkutilaan",
      "start_button": "Simuloi lataus",

      "loading": {
        "error": "Lataus epäonnistui",
        "success": "Lataus valmis",
        "active": "Lataus käynnissä"
      }
    }
  },

  "modal_page": {
    "site_title": "Modal (Dialogi) | Suomi.fi Design System",
    "heading": "Modal (Dialogi)",
    "ingress": "Dialogi on modaalinen komponentti, jolla voidaan esittää käyttäjälle olennaista tietoa muun sisällön päällä, samalla muu sisältö piilottaen. Dialogia voidaan käyttää esimerkiksi ilmoitusten näyttämiseen, toimintojen suorittamiseen poistumatta nykyisestä näkymästä tai toimintojen varmistamiseen.  Dialogi peittää nykyisen näkymän ja lukitsee fokuksen dialogin näkymän sisään. Kun toiminto on saatu suoritettua tai mikäli käyttäjä peruuttaa toiminnon, dialogi sulkeutuu ja palataan alkuperäiseen näkymään.",
    "accessibility_list": {
      "point_1": "Dialogin kanssa tulee aina käyttää otsaketta (ModalTitle). Suomi.fi Design Systemin komponenttiin otsake kuuluu pakollisena osana.",
      "point_2": "Dialogin alatunnisteen tulee aina sisältää toimintopainike jolla dialogi voidaan sulkea.",
      "point_3": "Dialogin ulkopuolella olevat sisällöt piilotetaan ruudunlukijoilta.",
      "point_4": "Fokus siirretään oletuksena dialogin otsakkeeseen dialogin avaamisen yhteydessä.",
      "point_5": "Fokus lukitaan dialogin sisään, eivätkä dialogin ulkopuolella olevat sisällöt ole fokusoitavissa.",
      "point_6": "Dialogin sulkemisen yhteydessä fokus palautetaan samaan elementtiin missä se oli ennen dialogin avaamista.",
      "point_7": "Dialogia käytetään tilanteissa joissa halutaan kiinnittää käyttäjän huomio vain tiettyyn asiaan tai toiminnallisuuteen."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text": "Dialogi koostuu otsakkeesta, sisältöalueesta ja alatunnisteesta sekä taustalle jäävät elementit visuaalisesti himmentävästä peitteestä. Otsake sijaitsee dialogin yläreunassa ja toimii osana dialogin sisältöä. Otsake saa fokuksen dialogin avaamisen yhteydessä. Sisältöalueelle voidaan sijoittaa mitä tahansa sisältöä, pois lukien uudet dialogit. Alatunnisteen tulee aina sisältää painike millä dialogi sulkeutuu. Alatunniste voi lisäksi sisältää mahdollisia toissijaisia painikkeita esimerkiksi toiminnon peruuttamista varten."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Dialogia voidaan käyttää joko pienempikokoisena varmistusdialogina tai laajempia kokonaisuuksia tukevana dialogina (oletus). Dialogi tukee sekä pieniä näyttöjä että työpöytäkäyttöä. Pienillä näytöillä dialogi täyttää aina koko näytön. Työpöytäkäytössä dialogin maksimikorkeus on aina 50 pikseliä vähemmän kuin näytön korkeus."
    },

    "example": {
      "open_text": "Avaa dialogi",
      "ok": "Hyväksy",
      "ok_aria": "Hyväksy ja sulje dialogi",
      "cancel": "Peruuta ja sulje dialogi",
      "cancel_aria": "Peruuta ja sulje dialogi",

      "default": {
        "heading": "Täysikokokoinen dialogi",
        "description": "Kun halutaan suorittaa laajempia toimintoja poistumatta nykyisestä näkymästä, voidaan käyttää täysikokoista dialogia. Dialogin oletusleveys on työpöytäkäytössä 800 pikseliä ja minimikorkeus 230 pikseliä. Työpöytäkäytössä dialogin korkeus kasvaa sisällön mukana ja sisältöalue muuttuu vieritettäväksi (scrolling), kun sisältö ei enää mahdu saatavilla olevaan tilaan.",
        "title": "Valitse julkaistavat kieliversiot",
        "content": "Valitse, mitkä kieliversiot haluat julkaista. Sisältö julkaistaan heti, ellet ajasta sisällölle julkaisuajankohtaa. Julkaisemasi sisältö näkyy Suomi.fi verkkopalvelussa noin 10-15 minuutin viiveellä. Jos jätät kieliversion luonnostilaan, se näkyy vain palvelutietovarannossa.",
        "group_open_all": "Avaa laajennuspaanelit",
        "group_close_all": "Sulje laajennuspaanelit",
        "aria_open": "Avaa laajennuspaneeli",
        "aria_close": "Sulje laajennuspaneeli",
        "checkbox_content_edited": "Muokattu",
        "date": "16.4.2021 2.20",
        "checkbox_content_edited_by": "Muokkaaja",
        "email": "taneli.kayttaja@dvv.fi",
        "checkbox_hint1": "Suomi - luonnos",
        "checkbox_label1": "Sukunimen muuttaminen",
        "checkbox_hint2": "Ruotsi - julkaistu",
        "checkbox_label2": "Ändring av efternamn",
        "checkbox_hint3": "Englanti - muokattu",
        "checkbox_label3": "Change of surname",
        "publish": "Julkaise",
        "aria_publish_disabled": "Julkaistavia tietoja ei ole valittu.",
        "cancel": "Peruuta"
      },

      "confirm": {
        "heading": "Varmistusdialogi",
        "description": "Ilmoitusten näyttämiseen ja toimintojen varmistamiseen käytetään varmistusdialogia. Varmistusdialogi keskeyttää käyttäjän toiminnan ja pyytää varmistuksen meneillään olevalle toiminnolle tai ilmoitukselle. Esimerkiksi ennen kohteen poistamista käyttäjältä varmistetaan, että hän todella haluaa poistaa valitsemansa kohteen. Varmistusdialogin oletusleveys on työpöytäkäytössä 540 pikseliä ja minimikorkeus 190 pikseliä. Työpöytäkäytössä varmistusdialogin korkeus kasvaa sisällön mukana, mutta varmistusdialogi ei tue vieritystä (scrolling). Varmistusdialogia tulee käyttää vain lyhyiden sisältöjen esittämiseen.",
        "title": "Poista ilmoitettu tieto",
        "content": "Olet poistamassa kutsumanimen voimassaolevista tiedoistasi.",
        "save": "Hyväksy",
        "aria_save": "Hyväksy tietojen poistaminen ja sulje dialogi.",
        "cancel": "Peruuta",
        "aria_cancel": "Peruuta tietojen poistaminen ja sulje dialogi."
      },

      "small_screen": {
        "heading": "Dialogi pienillä näytöillä",
        "description": "Pienillä näytöillä dialogi täyttää aina koko näytön riippumatta siitä onko kyseessä varmistusdialogi vai täysikokoinen dialogi.",
        "title": "Dialogi pienillä näytöillä",
        "content": "Dialogin sisältö"
      }
    }
  },
  "multiselect_page": {
    "site_title": "MultiSelect (Monivalinta) | Suomi.fi Design System",
    "heading": "MultiSelect (Monivalinta)",
    "ingress": "Monivalinta-komponentin avulla käyttäjä voi valita yhden tai useamman vaihtoehdon listalta.",
    "note_accessibility": "Monivalinta ei toimi tällä hetkellä saavutettavasti VoiceOver ruudunlukijalla mikäli käytössä on MacOS ja Safari. Ongelma ei ilmene Chromiumpohjaisilla selaimilla, kuten Chromella tai Edgellä.",

    "accessibility_list": {
      "point_1": "Listalla olevien vaihtoehtojen tekstien tulee olla uniikkeja.",
      "point_2": "Monivalinnan kanssa tulee aina käyttää otsaketta (label). Suomi.fi Design Systemin komponenttiin otsake kuuluu pakollisena osana.",
      "point_3": "Ohjeistava kenttäteksti (visualPlaceholder) auttaa hahmottamaan syötteen paikan. Sen ei tule sisältää käyttötilanteen kannalta olennaista tietoa.",
      "point_4": "Komponentille voidaan asettaa virhetila, jolla voidaan indikoida esimerkiksi virheellistä tai puuttuvaa syötettä. Virhetilassa komponentin reunukset sekä komponentin alla näytettävä tilateksti muuttuvat punaiseksi."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Monivalinta koostuu otsakkeesta, hakukentästä, valikosta, tilatekstistä, tehtyjen valintojen listasta sekä tehtyjen valintojen poistamiseen tarkoitetusta tyhjennyspainikkeesta. Valikko aukeaa kun fokus siirtyy hakukenttään. Valikossa näytettäviä vaihtoehtoja rajataan hakukentän tekstin mukaisesti.",
      "text_2": "Valinnat voivat olla pakollisia, milloin niitä ei voi muokata. Valikosta valitut ja pakolliset vaihtoehdot näytetään listana hakukentän alla. Valitut vaihtoehdot, pakollisia lukuunottamatta, voi poistaa tyhjennyspainikkeen avulla."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Monivalintaa käytetään tilanteissa, missä käyttäjä voi valita useita vaihtoehtoja ennaltamääritellyistä vaihtoehdoista ja erityisesti tilanteissa, missä vaihtoehtoja on paljon ja niiden rajaaminen helpottaa valinnan tekemistä."
    },

    "example": {
      "label": "Työkalut",
      "hint_text": "Vaihtoehtoja voi rajata kirjoittamalla kenttään",
      "visual_placeholder": "Valitse työkalut",
      "remove_all_selections": "Poista kaikki valinnat",
      "selected_amount_text": "työkalua valittu",
      "options_available_text": "vaihtoehtoa",
      "option_chip_removed_text": "poistettu",
      "no_items": "Ei vaihtoehtoja",
      "chip_action_label": "Poista",

      "tools": {
        "jackhammer": "Poravasara",
        "hammer": "Vasara",
        "sledgehammer": "Moukari",
        "spade": "Lapio",
        "powersaw": "Käsisirkkeli",
        "shovel": "Kauha",
        "ironstick": "Rautakanki",
        "rake": "Harava",
        "motorsaw": "Moottorisaha"
      }
    }
  },

  "notification_page": {
    "site_title": "Notification (Ilmoitus) | Suomi.fi Design System",
    "heading": "Notification (Ilmoitus)",
    "ingress": "Ilmoitus on komponentti, jonka avulla käyttäjälle voidaan välittää olennaista palvelun osaan ja käyttäjän toimintaan liittyvää palautetta ja tietoa. ",
    "accessibility_list": {
      "point_1": "Mikäli ilmoituksia on tarkoitus lisätä sivulle dynaamisesti, niitä varten kannattaa luoda ruudunlukijakäyttäjiä varten live region, jonka sisään ilmoitukset lisätään. Tällöin myös ruudunlukijakäyttäjät saavat tiedon sivulle lisätystä ilmoituksesta.",
      "point_2": "Ilmoituksen otsikkotaso on määriteltävissä käyttötapauksen mukaan. Käytä ilmoituksessa otsikkotasoa, joka ei riko näkymän otsikkojärjestystä.",
      "point_3": "Sivulla voi olla yhtä aikaa useita ilmoituksia näkyvissä."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Komponentti koostuu ilmoituksen tyyppiä kuvaavasta ikonista, otsikosta ja pääsisällöstä sekä \"sulje\" painikkeesta. Ilmoituksen pääsisällön alle on myös mahdollista lisätä toimintoelementtejä, kuten painikkeita."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Ilmoituksia voidaan käyttää joko näkymän pääsisällön alussa tai relevantissa paikassa sisällön seassa, ja siitä on olemassa kaksi eri varianttia. Huomioilmoitus kertoo, että palvelussa on jotain huomioitavaa. Huomioilmoituksen tunnisteväri on sininen ja sitä käytetään tilanteissa, jotka eivät vaadi käyttäjältä varsinaista reagointia. Virheilmoitus viestii käyttäjälle merkittävästä virhetilanteesta tai poikkeuksesta tietyssä näkymässä. Virheilmoituksen tunnisteväri on punainen. Kapeilla näytöillä, kuten mobiilissa käytetään lisäksi pienille ruuduille tarkoitettuja tyylejä."
    },

    "example": {
      "error": {
        "heading": "Et voi muokata tätä versiota",
        "paragraph": "Sisällöstä on olemassa uudempi versio (28.12.2021)",
        "close_button": "Sulje"
      },

      "info": {
        "section_heading": "Ilmoitus toimintoelementeillä",
        "description": "Ilmoitukseen voidaan tarvittaessa lisätä toimintoelementtejä, jotka näytetään pääsisällön alla.",
        "heading": "Käännös saapunut (ruotsi)",
        "paragraph": "Tarkista käännös ja muokkaa sitä tarvittaessa",
        "action_link": "Siirry tarkastelemaan käännöstä",
        "close_button": "Sulje"
      }
    }
  },
  "pagination_page": {
    "site_title": "Pagination (Sivutus) | Suomi.fi Design System",
    "heading": "Pagination (Sivutus)",
    "ingress": "Sivutus on komponentti, jonka avulla käyttäjä voi navigoida useille sivuille jaettua sisältöä. Sivustusta käytetään esimerkiksi hakutulosten näyttämiseen.",
    "accessibility_list": {
      "point_1": "Tieto sivun vaihdosta välitetään ruudunlukijalle. Komponentissa on visuaalisesti piilotettu kenttä tätä tarkoitusta varten.",
      "point_2": "Mikäli sivuja on paljon, käyttäjälle voidaan tarjota mahdollisuus sivunumeron syöttämiseen erilliseen sivunumerokenttään.",
      "point_3": "Ruudunlukijalle sivunumeron tietokentän teksti kannattaa antaa ilman erikoismerkkejä, esimerkiksi \"Sivu 1 kautta 20\", sillä erikoismerkkien lukutapa saattaa vaihdella.",
      "point_4": "Sivutuskomponentin yhteyteen on hyvä lisätä sisältöön vievä linkki tai hyppylinkki, jos näppäimistöä käyttäen matka sivutuskomponentista takaisin sisältöön on pitkä."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Sivutus koostuu kahdesta nuolipainikkeesta, tietokentästä sekä valinnaisesta sivunumeron syötekentästä. Nuolinpainikkeilla käyttäjä voi siirtyä yhden sivun kerrallaan eteen- tai taaksepäin. Tietokenttä on nuolipainikkeiden välissä ja sen tarkoitus on kertoa käyttäjälle nykyisen sekä viimeisen sivun numerot. Syötekentän avulla käyttäjä voi siirtyä suoraan haluamalleen sivulle."
    },
    "size_and_usage": {
      "heading": "Koko, käyttö ja variaatiot",
      "text_1": "Työpöytä- ja mobiilikäyttöön on määritelty erikseen omat koot sivutuskomponentista. Mobiilinäytöille suunnitellussa versiossa syötekenttä on nuolipainikkeiden alapuolella. Komponentin oletusvariaatio ei sisällä syötekenttää. Syötekenttää voidaan käyttää, jos sivuja on paljon.",
      "text_2": "Komponentti tulee sijoittaa sivutettavan sisällön alapuolelle.",
      "text_3": "Sivun vaihtuessa voi ruudunlukijalle antaa sisällöstä lisätietoa, esimerkiksi \"Sivu 2 kautta 5. Näytetään tulokset 10 viiva 20.\"."
    },

    "example": {
      "basic": {
        "heading": "Normaali käyttötapaus",
        "description": "Esimerkissä sivun vaihtuessa ruudunlukijalle annetaan tarkempaa tietoa sivun sisällöstä"
      },

      "success": {
        "heading": "Sivutus ilman syötekenttää"
      },

      "error": {
        "heading": "Sivutuksen mobiiliversio"
      }
    }
  },
  "radiobutton_page": {
    "site_title": "Radio Button (Valintanappi) | Suomi.fi Design System",
    "heading": "Radio Button (Valintanappi)",
    "ingress": "Valintanappi on lomakekomponentti, jolla voi valita yhden vaihtoehdon useammasta valintanapista koostuvasta valintanappiryhmästä. Käyttäjä voi valita kerrallaan vain yhden vaihtoehdon. Kun käyttäjä tekee uuden valinnan, aiemmin tehty valinta poistuu ja korvautuu uudella valinnalla.",
    "accessibility_list": {
      "point_1": "Pyri kuvaaviin, lyhyisiin ja ytimekkäisiin otsakkeisiin (label).",
      "point_2": "Sijoita saman aihealueen valintanapit ryhmiin asemoimalla ne päällekkäin.",
      "point_3": "Käytä valintanappia, kun käyttäjän halutaan valitsevan yksi annetuista vaihtoehdoista.",
      "point_4": "Älä käytä valintanappia tilanteissa, joissa käyttäjän on määrä valita useita vaihtoehtoja. Käytä tällöin valintaruutua (checkbox).",
      "point_5": "Älä käytä valintanappia tilan muutokseen. Käytä tähän tarkoitukseen valintakytkintä (toggle).",
      "point_6": "Käytä ohjetekstiä tilanteissa, joissa käyttäjälle on tarpeen antaa lisäohjeistusta valinnan suhteen. Yksinkertaisissa tapauksissa ohjetekstiä ei tarvita.",
      "point_7": "Valittuun valintanappiin voi liittyä lisävalintoja, kuten esimerkiksi tekstikenttiä tai valintakytkimiä.",
      "point_8": "Lisävalinnat ovat piilotettuina oletustilassa ja ne näytetään vasta, kun valintanappi valitaan.",
      "point_9": "Lisävalinnat asetellaan suoraan valitun valintanapin alle sisennettynä."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Valintanappi koostuu pyöreästä painikkeesta ja sen oikealla puolella olevasta label-tekstistä. Valintanapin alla voidaan näyttää valintanappiin liittyvä ohjeteksti. "
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Työpöytä- ja mobiilikäyttöön on määritelty erikseen omat koot valintanapista. Oletuksena käytetään pienempää valintanappia (default), mobiilinäytöillä niille suunniteltua kokoa (large)."
    },

    "example": {
      "default": {
        "title": "Toimitustapa",
        "content": "Sähköposti",
        "content2": "Tekstiviesti",
        "content3": "Paperiposti"
      },

      "large": {
        "title": "Valintanapin mobiiliversio (Large Radio Button)",
        "group_hint": "Valittua toimitustapaa ei voi muuttaa lomakkeen lähetyksen jälkeen",
        "description": "Mobiililaitteilla ja pienillä näytöillä käytetään valintanapin mobiiliversiota."
      },
      "hint": {
        "title": "Valintanappi ohjetekstillä (Radio Button + Hint Text)",
        "description": "Komponentille voidaan antaa ohjeteksti, joka näytetään komponentin alla.",
        "content": "Sähköisesti",
        "hint_text": "Saan päätökset Suomi.fi viesteihin",
        "content2": "Paperipostilla",
        "hint_text2": "Saan päätökset postitse kotiosoitteeseeni"
      },

      "disabled": {
        "title": "Estetty valintanappi (Disabled Radio Button)",
        "description": "Estetty valintanappi ei ole käyttäjän valittavissa. Estetty -tila voidaan poistaa esimerkiksi, kun käyttäjä suorittaa toisen vaadittavan toimenpiteen."
      }
    }
  },

  "search_input_page": {
    "site_title": "Search Input (Hakukenttä) | Suomi.fi Design System",
    "heading": "Search Input (Hakukenttä)",
    "ingress": "Hakukentän avulla käyttäjä voi etsiä tarvitsemaansa sisältöä sivustolta tai sovelluksesta hakusanoja käyttäen. Hakukenttä on käyttäjän tukena, mikäli hän ei löydä etsimäänsä sisältöä navigoimalla.",
    "accessibility_list": {
      "point_1": "Suurennuslasi-ikoni on yleisesti tunnettu tunniste hakutoiminnolle, ja siksi sitä ei ole välttämätöntä yhdistää visuaalisesti sanaan 'haku'. Ruudunlukijalle kerrotaan kuitenkin toiminnon nimi komponenttiin saavuttaessa.",
      "point_2": "Hakukenttää kannattaa käyttää, sillä useimmat käyttäjät hyötyvät siitä, että he voivat etsiä sisältöä sivustolta tai sovelluksesta.",
      "point_3": "Jos toteutuksen kokonaisuus on pieni ja yksinkertainen (single page ratkaisu), hakukenttää ei kuitenkaan tarvitse välttämättä käyttää.",
      "point_4": "Anna hakukentälle aina otsaketieto. Otsaketieto voidaan piilottaa visuaalisesti, mutta ruudunlukijakäyttäjälle otsake on tärkeä tieto hänen saapuessaan komponenttiin."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Hakukenttä, johon käyttäjä syöttää hakutermin tai -termit, on yhdistetty komponentti (hakukenttä, hakupainike ja hakusanan poistopainike). Tehty haku vie käyttäjän hakusivulle, jossa hakutulos näytetään. Hakukentässä käytetään ohjeistavaa kenttätekstiä (placeholder text), mutta se toimii ainoastaan visuaalisena lisänä näkeville käyttäjille. Kun hakukenttään on syötetty sisältöä, käyttäjälle näytetään hakupainike sinisellä painiketaustalla sekä hakusanan poistopainike, joka sijaitsee hakupainikkeen vasemmalla puolella. Komponentit ovat erikseen fokusoitavissa ja niihin pääsee näin navigoimaan myös näppäimistöllä."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Kirjoitettu hakuteksti on mahdollista poistaa kokonaan käyttämällä poistopainiketta. Hakupainikkeen painaminen tai hakusanan valitseminen näppäimistön enter-painikkeella vie käyttäjän hakusivulle, jossa näytetään hakutulokset. Mahdollinen uusi haku voidaan tehdä hakusivulla.",
      "text_2": "Hakukentän tulee olla leveydeltään minimissään 320 px. Hakukentän tekstialueen suositusleveys on minimissään 230 px, joka toteutuu komponentin 320 px kokonaisleveydellä. Tähän kokoon mahtuu hyvin yleisimpiin hakutilanteisiin riittävät hakuehdot. Kapeimmilla mobiilinäytöillä leveyttä rajoittavat sivumarginaalit, jolloin komponentin minimileveys on 290px.",
      "text_3": "Pienikokoisilla näytöillä hakukomponentin tulee aueta koko header-palkin päälle peittäen alleen muun headersisällön. Hakukomponentin tulee tällöin olla pienennettävissä erillisestä \"Sulje\" -painikkeesta. Mobiililaitteilla hakupalkki pysyy näkyvissä, vaikka käyttäjä klikkaa/täppää sisältöalueelle."
    },

    "in_ui": {
      "heading": "Komponentti käyttöliittymässä",
      "text_1": "Suomi.fi:n sivustohakukomponentti sijaitsee ylätunnisteessa kaikkialla verkkopalvelussa. On suositeltavaa asettaa hakukenttä sivuston yläreunaan tai osaksi ylätunnistetta. Useimmiten hakukenttä sijaitsee ylätunnisteen oikean laidan puolella."
    },

    "example": {
      "regular": {
        "label": "Hakukenttä",
        "clear_button_label": "Tyhjennä haku",
        "search_button_label": "Hae"
      }
    }
  },

  "service_navigation_page": {
    "site_title": "Service navigation (Palvelunavigaatio) | Suomi.fi Design System",
    "heading": "Service navigation (Palvelunavigaatio)",
    "ingress": "Palvelunavigaatiota käytetään jonkin sivusto-osion eri alasivujen tai alanäkymien välillä liikkumiseen.",
    "accessibility_list": {
      "point_1": "Navigaatioelementtien tekstisisältöjen tulee olla kuvaavia, ja ne on hyvä pyrkiä pitämään mahdollisimman lyhyinä. Kapean ruudun varianttia käytettäessä navigaation avaavan/sulkevan painikkeen tekstin tulee niin ikään olla kuvaava ja ytimekäs.",
      "point_2": "Ruudunlukijasaavutettavuuden varmistamiseksi tulee huolehtia, että yksittäisille navigaatioelementeille (linkit) asetetaan asianmukaiset aria-attribuutit: aria-current tällä hetkellä aktiiviselle sivulle, aria-label mikäli halutaan välittää linkin tekstisisällön ulkopuolista informaatiota ja aria-disabled mikäli linkki on estetty.",
      "point_3": "Komponentille tulee antaa ylätason aria-label, joka kertoo ruudunlukijalle navigaation kontekstin ja tarkoituksen.",
      "point_4": "Palvelunavigaatiolle on lisäksi hyvä antaa HTML-id, jotta siihen voidaan liikkua suoraan esimerkiksi SkipLink-navigaatioelementeistä."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Palvelunavigaatio on navigaatioelementti, jonka sisällä on lista. Komponentin tekninen toteutus mahdollistaa sen, että lista voi sisältää tavanomaisten linkkien lisäksi esimerkiksi painikkeita tai muita semanttisia elementtejä. Kaikki listan elementit ovat kuitenkin semantiikasta huolimatta visuaaliselta tyyliltään samanlaisia. Listan elementit eivät ole toisilleen hierarkisesti alisteisia vaan ne kaikki ovat samalla tasolla.",
      "text_2": "Kapeille ruuduille suunnitellussa variantissaan komponentti sisältää painikkeen, josta varsinainen navigaatioelementti voidaan näyttää ja piilottaa."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Navigaatioelementtien sisällä on yllä olevan koodiesimerkin mukaisesti suunniteltu käytettävän RouterLink-komponenttia, joka voidaan semanttisesti renderöidä minä tahansa komponenttina kuten painikkeena tai jonkin kirjaston omana linkkikomponenttina. Tutustu komponentin tekniseen dokumentaatioon saadaksesi lisää esimerkkejä RouterLinkin käytöstä.",
      "text_2": "Palvelunavigaatio asemoidaan tavallisesti sivun vasempaan palstaan, sisältöalueen ollessa sen oikealla puolella. Se ottaa sivuttaissuunnassa kaiken se tilan, joka sille on tarjolla ja täten sen leveyttä kontrolloidaan ympäröivän elementin leveyttä säätämällä. Pienillä ruuduilla (mobiililaitteet) käytetään komponentista niille tarkoitettua varianttia ja asemoidaan komponentti sivun varsinaisen sisältöalueen yläpuolelle. ",
      "text_3": "Palvelunavigaatio soveltuu käyttöön hyvin silloin, kun navigaation linkit ovat hierarkisesti kaikki samalla tasolla ja navigoitava sivusto on tyyliltään sovellusmainen (ks. sähköpostiohjelman tyylinen esimerkki yllä). Jos navigaation on tarpeen sisältää alasivuja tai -kategorioita, tulee käyttää sivunavigaatio-komponenttia."
    },

    "example": {
      "arialabel": "Päänavigaatio",
      "navitem1": "Saapuneet",
      "navitem1_arialabel": "Saapuneet. 16 lukematonta viestiä.",
      "navitem2": "Lähetetyt",
      "navitem3": "Luonnokset",
      "navitem4": "Asetukset",
      "navitem5": "Laitteet",

      "smallscreen": {
        "title": "Pienen ruutukoon variantti",
        "paragraph": "Mobiililaitteilla palvelunavigaatio voidaan avata ja sulkea painiketta painamalla",
        "buttontext": "Valikko"
      }
    }
  },

  "side_navigation_page": {
    "site_title": "Side navigation(Sivunavigaatio) | Suomi.fi Design System",
    "heading": "Side navigation(Sivunavigaatio)",
    "ingress": "Sivunavigaatiota käytetään sisältösivujen välillä navigointiin erityisesti silloin kun sivut on ryhmitelty useaan eri alakategoriaan.",
    "accessibility_list": {
      "point_1": "Komponentin otsikon ja navigaatioelementtien tekstisisältöjen tulee olla kuvaavia, ja ne on hyvä pyrkiä pitämään mahdollisimman lyhyinä.",
      "point_2": "Ruudunlukijasaavutettavuuden varmistamiseksi tulee huolehtia, että yksittäisille navigaatioelementeille (linkit) asetetaan asianmukaiset aria-attribuutit: aria-current=page tällä hetkellä aktiiviselle sivulle, aria-current=location aktiivisen sivun yläsivulle, aria-label mikäli halutaan välittää linkin tekstisisällön ulkopuolista informaatiota ja aria-disabled mikäli linkki on estetty.",
      "point_3": "Komponentille tulee antaa ylätason aria-label, joka kertoo ruudunlukijalle navigaation kontekstin ja tarkoituksen.",
      "point_4": "Sivunavigaatiolle on lisäksi hyvä antaa HTML-id, jotta siihen voidaan liikkua suoraan esimerkiksi SkipLink-navigaatioelementeistä."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Sivunavigaatio on navigaatioelementti, jonka sisällä on lista. Komponentin tekninen toteutus mahdollistaa sen, että lista voi sisältää tavanomaisten linkkien lisäksi esimerkiksi painikkeita tai muita semanttisia elementtejä. Kaikki listan elementit ovat kuitenkin semantiikasta huolimatta visuaaliselta tyyliltään samanlaisia. Varsinaisen linkkilistan lisäksi komponenttiin kuuluu sen otsikko sekä siihen liittyvä ikoni.",
      "text_2": "Sivunavigaatiossa linkit ovat hierarkisesti puurakenteessa. Komponentissa on mahdollista näyttää linkkejä kolmessa tasossa. Navigaatioelementin ollessa aktiivisena sen alasivut ovat näkyvissä.",
      "text_3": "Kapeille ruuduille suunnitellussa variantissaan komponentti sisältää painikkeen, josta varsinainen navigaatioelementti voidaan näyttää ja piilottaa. "
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Navigaatioelementtien sisällä on yllä olevan koodiesimerkin mukaisesti suunniteltu käytettävän RouterLink-komponenttia, joka voidaan semanttisesti renderöidä minä tahansa komponenttina kuten painikkeena tai jonkin kirjaston omana linkkikomponenttina. Tutustu komponentin tekniseen dokumentaatioon saadaksesi lisää esimerkkejä RouterLinkin käytöstä.",
      "text_2": "Palvelunavigaatio asemoidaan tavallisesti sivun vasempaan palstaan, sisältöalueen ollessa sen oikealla puolella. Se ottaa sivuttaissuunnassa kaiken se tilan, joka sille on tarjolla ja täten sen leveyttä kontrolloidaan ympäröivän elementin leveyttä säätämällä. Pienillä ruuduilla (mobiililaitteet) käytetään komponentista niille tarkoitettua varianttia ja asemoidaan komponentti sivun varsinaisen sisältöalueen yläpuolelle. "
    },

    "example": {
      "title": "Parisuhde ja perhe",
      "arialabel": "Sivustonavigaatio",
      "navitem1": "Parisuhde",
      "navitem1-2-1": "Tietoa eri parisuhdemuodoista",
      "navitem1-2-2": "Avioliiton solmiminen",
      "navitem1-2-1-1": "Tietoa avioliitosta",
      "navitem1-2-1-2": "Tietoa avoliitosta",
      "navitem1-2-1-3": "Tietoa rekisteröidystä parisuhteesta",
      "navitem2": "Lapsen saaminen ja hoito",
      "navitem3": "Tervetuloa täysi-ikäiseksi!",
      "navitem4": "Avo- tai avioero",
      "navitem5": "Läheisen kuolema",

      "smallscreen": {
        "title": "Pienen ruutukoon variantti",
        "description": "Mobiililaitteilla sivunavigaatio voidaan avata ja sulkea painiketta painamalla"
      }
    }
  },

  "singleselect_page": {
    "site_title": "Single Select (Yksittäisvalinta) | Suomi.fi Design System",
    "heading": "Single Select (Yksittäisvalinta)",
    "ingress": "Yksittäisvalinta-komponentin avulla käyttäjä voi valita yhden vaihtoehdon listalta.",
    "accessibility": "Yksittäisvalinta ei toimi tällä hetkellä saavutettavasti VoiceOver ruudunlukijalla mikäli käytössä on MacOS ja Safari. Ongelma ei ilmene Chromium-pohjaisilla selaimilla, kuten Chromella tai Edgellä.",

    "accessibility_list": {
      "point_1": "Listalla olevien vaihtoehtojen tekstien tulee olla uniikkeja.",
      "point_2": "Yksittäisvalinnan kanssa tulee aina käyttää otsaketta (label). Suomi.fi Design Systemin komponenttiin otsake kuuluu pakollisena osana.",
      "point_3": "Ohjeistava kenttäteksti (visualPlaceholder) auttaa hahmottamaan syötteen paikan. Sen ei tule sisältää käyttötilanteen kannalta olennaista tietoa.",
      "point_4": "Komponentille voidaan asettaa virhetila, jolla voidaan indikoida esimerkiksi virheellistä tai puuttuvaa syötettä. Virhetilassa komponentin reunukset sekä komponentin alla näytettävä tilateksti muuttuvat punaiseksi."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Yksittäisvalinta koostuu otsakkeesta, hakukentästä, valikosta, tilatekstistä, valinnan poistamiseen tarkoitetusta tyhjennyspainikkeesta sekä valikon näyttämiseen ja piilottamiseen tarkoitetusta painikkeesta. Valikko aukeaa automaattisesti kun fokus siirtyy hakukenttään ja sulkeutuu kun fokus siirtyy pois hakukentästä. Valikon voi myös näyttää tai piilottaa siihen tarkoitetun painikkeen avulla, mutta tämä toiminnallisuus ei ole käytettävissä näppäimistöllä. Valikossa näytettäviä vaihtoehtoja rajataan hakukentän tekstin mukaisesti.",
      "text_2": "Yksittäiset valinnat voivat olla poistettuna käytöstä, milloin niitä ei voi valita. Valitun vaihtoehdon voi poistaa tyhjennyspainikkeen avulla."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Yksittäisvalintaa käytetään tilanteissa, missä käyttäjä voi valita yhden vaihtoehdon ennaltamääritellyistä vaihtoehdoista ja erityisesti tilanteissa, missä vaihtoehtoja on paljon ja niiden rajaaminen helpottaa valinnan tekemistä."
    },

    "example": {
      "label_text": "Valitse asiakategoria",
      "hint_text": "Rajaa tuloksia kirjoittamalla kenttään tai valitse valikosta",
      "clear_button_label": "Poista valinta",
      "visual_placeholder": "Kirjoita asiakategorian nimi",
      "no_items_text": "Hakusanalla ei löytynyt tuloksia.",
      "aria_options_available_text": "Vaihtoehtoa saatavilla"
    }
  },

  "text_page": {
    "site_title": "Text (Teksti) | Suomi.fi Design System",
    "heading": "Text (Teksti)",

    "title": "Kirjasintyyppi (Font)",
    "text": "Suomi.fi-tyyleissä ja -käyttöliittymäkomponenteissa käytetty kirjasin Source Sans Pro on Googlen välittämä open source -fontti, kaikki sen leikkaukset ovat ilmaisia ja vapaasti käytettävissäsi (Open Font License). Kirjasimen voi ladata omalle työasemalle Google Fontsista.",
    "link_text": "Lataa kirjasin (Google Fonts) Source Sans Pro",
    "url": "https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=2ahUKEwik2qOSkJ3iAhVDmYsKHfIiCX8QFjAAegQICBAC&url=https%3A%2F%2Ffonts.google.com%2Fspecimen%2FSource%2BSans%2BPro&usg=AOvVaw1C5bQ5gIVNkjiNqeXsAcB-",
    "title_body": "Leipäteksti (Body)",
    "text_1": "Suomi.fi-teemassa leipätekstin oletuskoko on 18px sekä mobiili- että desktop-näkymissä. Kun halutaan erottaa rakenteellisesti visuaalisin keinoin tietty tekstikappale tms., voidaan käyttää pienempää 16px fonttia. Suomi.fi-teemassa leipäteksti on oletuksena sävyltään musta (blackBase) ja variaatiota luomassa käytetään tumman harmaata (depthDark1).",
    "text_2": "Lihavoitua leikkausta käytetään leipätekstissä, kun halutaan korostaa käyttäjälle erityisen huomioitavaa tietoa. Lihavoitua tekstiä tulee käyttää harkiten. Jos lihavointia on käytetty liikaa, on käyttäjän vaikea ymmärtää, mihin hänen tulisi erityisesti kiinnittää huomiota sisällössä. ",
    "body_description": "Suomi.fi-teeman leipäteksteissä käytetään Source Sans Pro Regular sekä Source Sans Pro Semibold -fonttia.",
    "lead_title": "Ingressi (Lead)",
    "lead_description": "Ingressi on sivun alussa esiintyvä tiivistelmä sivun sisällöstä. Ingressiä käytetään vain kerran yhdessä näkymässä. Suomi.fi-teemassa ingressitekstin koko on 22 px ja pienellä näytöllä 20 px."
  },

  "textarea_page": {
    "site_title": "Textarea (Tekstialue) | Suomi.fi Design System",
    "heading": "Textarea (Tekstialue)",
    "ingress": "Tekstialue on komponentti, johon käyttäjä voi syöttää otsakkeessa pyydetyn tiedon tai kirjoittaa omin sanoin vastauksensa otsakkeessa annettuun kysymykseen. Tekstialuetta käytetään tilanteissa, joissa käyttäjälle halutaan antaa mahdollisuus pidemmän vastauksen antamiseen. Lyhyitä tekstimuotoisia vastauksia varten käytetään tekstikenttää.",
    "accessibility_list": {
      "point_1": "Tekstialueen kanssa tulee aina käyttää otsaketta (label). Suomi.fi Design Systemin komponenttiin otsake kuuluu pakollisena osana.",
      "point_2": "Tekstialueen ohjeteksti on valinnainen tieto ja sen voi jättää lisäämättä komponenttiin, jos kenttään täytettävä asia on hyvin yksinkertainen.",
      "point_3": "Tekstialueen ohjeistava kenttäteksti (visualPlaceholder) auttaa hahmottamaan syötteen paikan. Sen ei tule sisältää käyttötilanteen kannalta olennaista tietoa. Ohjeistamiseen tulee käyttää ensisijaisesti ohjetekstiä (hintText).",
      "point_4": "Komponentille voidaan asettaa virhetila, jolla voidaan indikoida esimerkiksi virheellistä tai puuttuvaa syötettä. Virhetilassa komponentin reunukset sekä komponentin alla näytettävä tilateksti muuttuvat punaiseksi."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Tekstialue koostuu otsakkeesta ja syötekentästä. Suomi.fi -palvelussa käytetään yleensä puhuttelumuodossa olevaa ohjeistavaa kenttätekstiä. Lisäksi komponentti voi sisältää ohjetekstin, joka sijoittuu otsakkeen ja syötekentän väliin. Komponenttiin on liitettävissä notifikaatiotieto mahdollisesta virheestä. Notifikaatiotieto näytetään syötekentän alapuolella. Tekstimuotoisen notifikaation lisäksi kentän reunus on notifikaation aikana värikoodattu virheen merkiksi."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Tekstialueen oletuskoko asetetaan toivotun sisällön mukaan, mutta ei kuitenkaan liioitellun suureksi. Jos käyttäjä täyttää tekstialue-komponenttiin enemmän tekstiä kuin siihen mahtuu, on alue vieritettävissä (scrolling) tai venytettävissä sisällön mukaiseksi komponentin oikeasta alakulmasta."
    },

    "example": {
      "regular": {
        "label": "Perustelut",
        "hint_text": "Perustele, miksi toimenpide tehdään ja millä tavalla toimenpide on päämiehen edun mukainen.",
        "placeholder": "Kirjoita perustelut"
      },
      "error": {
        "title": "Ohje- ja notifikaatiotekstit",
        "description": "Komponentille voidaan antaa ohje- ja notifikaatiotekstit. Ohjeteksti näytetään otsikon ja syötekentän välissä, ja notifikaatioteksti syötekentän alapuolella.",
        "label": "Perustelut",
        "hint_text": "Perustele, miksi toimenpide tehdään ja millä tavalla toimenpide on päämiehen edun mukainen.",
        "placeholder": "Kirjoita perustelut",
        "status_text": "Perustelut on pakollinen tieto"
      },
      "disabled": {
        "title": "Estetty Tekstialue (Disabled Textarea)",
        "description": "Estetty tekstialue ei ole muokattavissa. Estetty -tila voidaan poistaa esimerkiksi, kun käyttäjä suorittaa toisen vaadittavan toimenpiteen.",
        "label": "Perustelut"
      }
    }
  },

  "text_input_page": {
    "site_title": "Text Input (Tekstikenttä) | Suomi.fi Design System",
    "heading": "Text Input (Tekstikenttä)",
    "ingress": "Tekstikenttä on komponentti, johon käyttäjä täyttää komponentin otsikossa pyydetyn tiedon tai kirjoittaa omin sanoin vastauksensa otsikossa annettuun kysymykseen. Käyttäjälle voidaan antaa tarpeen mukaan ohjeistusta, mutta yksinkertaisissa käyttötapauksissa ohjeistusta ei tarvita. Tekstikenttää käytetään, kun kenttään täytettävä tieto on lyhyt. Jos täytettävä tieto on pitkä ja vaatii monta riviä, käytetään tekstialue-komponenttia.",
    "accessibility_list": {
      "point_1": "Tekstikentän kanssa tulee aina käyttää otsaketta (label). Suomifi UI kirjaston komponenttiin otsake kuuluu pakollisena osana.",
      "point_2": "Success- ja error-kenttiin on varattu tekstialue kentän alle viestiä varten. Teksti kertoo käyttäjälle mikä on kenttään täytetyn sisällön tila. Tekstimuotoisen viestin lisäksi tila sisältää värikoodin ja tekstikentän leveämmän reunuksen, joka korostuu normaalisti näkeville henkilöille.",
      "point_3": "Tekstikentän leveys toimii visuaalisena rajoitteena käyttäjälle ja antaa vihjeen siihen syötettävästä informaation määrästä.",
      "point_4": "Tekstikenttä komponenttia käytetään silloin kuin käyttäjän tulee täyttää vain yhden rivin informaatiota, kuten esimerkiksi nimensä. Monta riviä (multiline) vaativille vastauksille käytä Tekstialue (Textarea) komponenttia."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Tekstikenttä koostuu otsakkeesta ja kentästä, jossa on käyttäjää ohjeistava kenttäteksti. Suomi.fi -palvelussa käytetään yleensä puhuttelumuodossa olevaa ohjeistavaa kenttätekstiä. Lisäksi kenttä voi sisältää ohjetekstin, joka sijoittuu otsakkeen ja kentän väliin, mutta on teknisesti osa otsikkoa. Näin ruudunlukija lukee ohjetekstin otsakkeen jälkeen. Kenttään on liitettävissä notifikaatiotieto mahdollisesta virheestä tai onnistumisesta. Notifikaatiotieto näytetään kentän alapuolella. Tekstimuotoisen notifikaation lisäksi kentän reunus on notifikaation aikana värikoodattu virheen tai onnistumisen merkiksi. Kentälle voidaan asettaa myös ikoni, joka esitetään kentän oikeassa laidassa. Ikonia voidaan hyödyntää kentän käyttötarkoituksen viestimiseen.",
      "text_2": "Lähtökohtaisesti kaikki lomakekentät ovat pakollisia, ja valinnaiset kentät merkitään valinnaisuustekstillä (optionalText). Valinnaisuusteksti näytetään suluissa otsakkeen lopussa."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Tekstikentän leveys on riippuu käyttötilanteesta. Täytettävän asian pitää mahtua tekstikenttään, mutta liian pitkä tekstikenttä antaa väärän viestin käyttäjälle.  Tutkimusten mukaan tyypillisesti kentän pituus on 18-33 merkkiä (englannin kieli). 33 merkkiä on leveydeltään noin 300 px jolloin marginaaleineen 33 merkin tekstikentän sopiva leveys on 320 px. Tekstikenttäkomponentin oletusleveys on 290px. Komponentin koko voi rajoittaa vastauksen laajuutta, mutta se voi myös ohjata käyttäjää vastaamaan riittävän tiiviisti."
    },

    "example": {
      "regular": {
        "label": "Normaali tekstikenttä"
      },
      "hint_text": {
        "title": "Tekstikenttä ohjetekstillä",
        "label": "Uusi sukunimi",
        "hint_text": "Kirjoita kenttään hakemasi sukunimi. Sukunimi voi olla yksi- tai kaksiosainen.",
        "placeholder": "Kirjoita sukunimi",
        "error_text": "Sukunimi ei voi sisältää numeroita"
      },
      "success": {
        "title": "Tekstikenttä hyväksytty (Success Text Input)",
        "label": "Hyväksytty tekstikenttä"
      },
      "error": {
        "title": "Tekstikenttä virheellinen (Error Text Input)",
        "label": "Virheellinen tekstikenttä",
        "status_text": "Virhe: kenttä ei voi olla tyhjä"
      },
      "disabled": {
        "title": "Tekstikenttä estetty (Disabled Text Input)",
        "description": "Disabloitu tekstikenttä estää kentän täyttämisen, kunnes käyttäjä suorittaa toisen vaadittavan toimenpiteen.",
        "label": "Estetty tekstikenttä"
      },
      "icon": {
        "title": "Tekstikenttä ikonilla",
        "label": "Palvelupaikka",
        "placeholder": "Valitse palvelupaikka"
      },
      "optional": {
        "title": "Valinnainen tekstikenttä ikonilla (Optional Text Input)",
        "label": "Palvelupaikka",
        "placeholder": "Valitse palvelupaikka",
        "optional_text": "valinnainen"
      }
    }
  },

  "toast_page": {
    "site_title": "Toast (Ponnahdusilmoitus) | Suomi.fi Design System",
    "heading": "Toast (Ponnahdusilmoitus)",
    "ingress": "Ponnahdusilmoitus on komponentti, jonka avulla käyttäjälle voidaan välittää käyttäjän toimintaan liittyvää palautetta. Käytetään tilanteissa, jotka eivät vaadi käyttäjältä varsinaista reagointia. Ponnahdusilmoitus kertoo, että käyttäjän suorittama toimenpide onnistui.",
    "accessibility_list": {
      "point_1": "Mikäli ponnahdusilmoituksia on tarkoitus lisätä sivulle dynaamisesti, niitä varten kannattaa luoda ruudunlukijakäyttäjiä varten live region (kts. linkki sivun alalaidassa), jonka sisään ponnahdusilmoitukset lisätään. Tällöin myös ruudunlukijakäyttäjät saavat tiedon sivulle lisätystä ponnahdusilmoituksesta.",
      "point_2": "Ponnahdusilmoituksen otsikkotaso on määriteltävissä tarvittaessa, ja komponenttia voidaan käyttää myös ilman otsikkoa.",
      "point_3": "Sivulla voi olla yhtä aikaa useita ponnahdusilmoituksia näkyvissä."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Komponentti koostuu ikonista, vaihtoehtoisesta otsikosta ja pääsisällöstä."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Ponnahdusilmoitukset tulee pitää näkyvissä joko 10 sekuntia tai niin kauan kuin käyttäjä pitää kursoria ilmoituksen päällä. Ponnahdusilmoitukset tulee poistaa näkyvistä liu'uttamalla ne ulos sivun ylälaidasta.",
      "text_2": "Työpöytänäkymässä, kun sivu on vieritetty ylös, ponnahdusilmoitus tulee olla sivun ylälaitaan kiinnittyneenä. Kun käyttäjä vierittää sivua alaspäin niin, että sivu ylälaita peittyy, tulee ponnahdusilmoitus liukua näkyviin oikeaan ylälaitaan. Ponnahdusilmoitus siis kelluu mukana, kun sivua vieritetään alaspäin."
    },

    "link_text": "Lisätietoa live regioneista",
    "url": "https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA/ARIA_Live_Regions",
    "example": {
      "content": "Tallentaminen onnistui"
    }
  },

  "toggle_page": {
    "site_title": "Toggle (Valintakytkin) | Suomi.fi Design System",
    "heading": "Toggle (Valintakytkin)",
    "ingress": "Valintakytkintä käytetään esimerkiksi kahden toisensa pois sulkevan tilan tai toiminnan vaihtamisessa. Sitä ei pidä käyttää korvaamaan valintaruutu-komponenttia (checkbox). Käytä valintakytkintä harkiten. ",
    "accessibility_list": {
      "point_1": "Kognitiivisen saavutettavuuden kannalta on suositeltavaa esittää selkeä ohjeistusteksti komponentin yhteydessä, koska valintakytkin muuttaa, piilottaa tai muokkaa sisältöä valinnan mukaisesti.",
      "point_2": "Käytä valintakytkintä harkiten. Suomi.fi:ssä valintakytkin-komponenttia käytetään vain tilan muutokseen. Esimerksiksi Suomi.fi:n hakutoiminnossa valintakytkimellä saa hakutuloksissa näkyviin vain viittomakielisten sisältöjen hakutulokset."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Valintakytkimessä näytettävä label-teksti kertoo, mitä ollaan kytkemässä päälle tai pois. Komponentissa on kaksi tilaa, pois päältä ja päällä. Pois päältä -tila on harmaa ja päällä-tila on pääosin vihreä. Valintakytkin voi olla myös disabloitu molemmissa tiloissa. Komponentin yhteyteen on hyvä liittää ohjeteksti, jotta käyttäjä ymmärtää, mikä toimenpide tapahtuu, kun valintakytkimen asentoa muutetaan."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Valintakytkin piilottaa, vaihtaa, muuttaa sisällön tai näkymän valinnan mukaisesti. Toiminto tapahtuu välittömästi eikä vaadi käyttäjältä muuta erillistä vahvistusta. Valintakytkimessä on aina yksi oletustila valmiiksi valittuna. Valintakytkintä tulisi käyttää ainoastaan sellaisissa tilanteissa, joissa käyttäjän täytyy valita kahdesta vastakkaisesta tilasta, esimerkiksi asettaa jokin toiminto päälle tai pois päältä.",
      "text_2": "Valintakytkimen vaiheiden vastakohtaiset värit tulisi tukea komponentin käytettävyyttä ja auttaa käyttäjää hahmottamaan, missä tilassa kytkin on (päällä/pois päältä). Jos muokkaat väriä, muista huomioida saavutettavuusvaatimukset (WCGA 2.1) ja eri tilojen riittävä eroavuus toisistaan."
    },

    "link1_text": "WCAG 2.1 - 1.4.1 Värien käyttö",
    "link2_text": "WCAG 2.1 - 1.4.3 Kontrasti (minimi)",

    "variations": {
      "heading": "Variaatiot",
      "text_1": "Valintakytkimestä on saatavilla kaksi eri variaatiota; painike (button) ja kenttä (input). Painiketta on tarkoitus käyttää kun kyseessä on toiminto, heti tapahtuva muutos. Kenttää käytetään lomakkeissa, jolloin lomaketta lähettäessä sen arvo luetaan."
    },

    "example": {
      "label_button": "Esimerkkitoiminto, painike-variaatio",
      "label_input": "Esimerkkitoiminto, kenttä-variaatio",
      "state_on": " päällä.",
      "state_off": " pois päältä."
    }
  },

  "tooltip_page": {
    "site_title": "Tooltip (Lisätieto) | Suomi.fi Design System",
    "heading": "Tooltip (Lisätieto)",
    "ingress": "Lisätieto-komponentin avulla voidaan esittää tiettyyn sivun kohtaan tai elementtiin liittyvää lisätietoa. Komponentti avautuu painamalla infoikonipainiketta. ",
    "accessibility_list": {
      "point_1": "Lisätieto-komponenttia tulisi käyttää vain ns. viimeisenä keinona. Erillinen ohjeteksti on pääsääntöisesti parempi vaihtoehto.",
      "point_2": "Lisätiedon on syytä sisältää vain tekstiä; interaktiivisia elementtejä tulisi välttää.",
      "point_3": "Sisältöalueella tulisi olla otsikko, joka tiivistää lisätiedon sisällön.",
      "point_4": "Sisällön tulisi olla kohtuullisen lyhyt, sillä pienemmällä ruutukoolla käytettävyys kärsii."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Lisätieto-komponentti koostuu infoikonin sisältävästä painikkeesta ja varsinaisen tiedon sisältävästä elementistä, joka aukeaa infoikonipainiketta painamalla. Aukeavassa elementissä on sisältöalue ja toinen ikonipainike, jolla lisätieto voidaan sulkea. Lisätieto voidaan sulkea myös samasta ikonipainikkeesta, jonka avulla se aukaistiin."
    },
    "size_and_usage": {
      "heading": "Koko ja käyttö",
      "text_1": "Lisätietoa on tarkoitus käyttää pääasiassa lomakkeissa. Niissä komponenttia voidaan käyttää kertomaan esimerkiksi jonkin kentän täyttöön liittyvä ohjeistus, mikäli se ei onnistu kentän pääasiallisella ohjetekstillä.",
      "text_2": "Lisätieto-komponentin sisältöön voidaan tarvittaessa lisätä esimerkiksi linkki, joka vie käyttäjän Ohjeet ja tuki -osioon (uudessa välilehdessä/ikkunassa)."
    },

    "example": {
      "text": "Kutsumanimi",
      "aria_toggle": "Kutsumanimi, lisää tietoa",
      "aria_close": "Kutsumanimi, sulje lisätieto",
      "title": "Kutsumanimi",
      "description": "Virallinen etunimi jota käytetään kutsumanimenä"
    }
  },

  "wizard_navigation_page": {
    "site_title": "Wizard navigation (Vaihenavigaatio) | Suomi.fi Design System",
    "heading": "Wizard navigation (Vaihenavigaatio)",
    "ingress": "Vaihenavigaatiota käytetään vaiheistetun lomakkeen tai muun vastaavan käyttöliittymän eri vaiheiden esittämiseen ja niiden välillä siirtymiseen.",
    "accessibility_list": {
      "point_1": "Komponentin otsikon ja navigaatioelementtien tekstisisältöjen tulee olla kuvaavia, ja ne on hyvä pyrkiä pitämään mahdollisimman lyhyinä.",
      "point_2": "Ruudunlukijasaavutettavuuden varmistamiseksi tulee huolehtia, että yksittäisille navigaatioelementeille (linkit) asetetaan asianmukaiset aria-attribuutit: aria-current tällä hetkellä aktiiviselle vaiheelle, aria-label kertomaan mikäli vaihe on suoritettu ja aria-disabled mikäli linkki on estetty. Estettyjen linkkien tulee kuitenkin olla näppäimistökäyttäjien saavutettavissa.",
      "point_3": "Komponentille tulee antaa ylätason aria-label, joka kertoo ruudunlukijalle vaihenavigaation kontekstin ja tarkoituksen.",
      "point_4": "Vaihenavigaatiolle on lisäksi hyvä antaa HTML-id, jotta siihen voidaan liikkua suoraan esimerkiksi SkipLink-navigaatioelementeistä.",
      "point_5": "Linkkejä klikattaessa vaihenavigaatiota käyttävän sovelluksen on huolehdittava ruudunlukijan saavan täsmällisen tiedon siitä, että siirryttiin uuteen näkymään."
    },
    "what_does_the_component_contain": {
      "heading": "Mistä komponentti koostuu",
      "text_1": "Vaihenavigaatio on navigaatioelementti, jonka sisällä on lista. Komponentin tekninen toteutus mahdollistaa sen, että lista voi sisältää tavanomaisten linkkien lisäksi esimerkiksi painikkeita tai muita semanttisia elementtejä. Kaikki listan elementit ovat kuitenkin semantiikasta huolimatta visuaaliselta tyyliltään samanlaisia. Listan elementit esitetään vertikaalisena polkuna, jota käyttäjä kulkee ylhäältä alaspäin.",
      "text_2": "Kapeille ruuduille suunnitellussa variantissaan komponentti sisältää painikkeen, josta varsinainen navigaatioelementti voidaan näyttää ja piilottaa."
    },
    "usage_and_positioning": {
      "heading": "Käyttö ja asemointi",
      "text_1": "Navigaatioelementtien sisällä on suunniteltu käytettävän RouterLink-komponenttia, joka voidaan semanttisesti renderöidä minä tahansa komponenttina kuten painikkeena tai jonkin kirjaston omana linkkikomponenttina. Tutustu komponentin tekniseen dokumentaatioon saadaksesi lisää esimerkkejä RouterLinkin käytöstä.",
      "text_2": "Vaihenavigaatiota on tarkoitettu käytettäväksi yksinomaan vaiheistettujen lomakkeiden tai muiden vastaavien käyttöliittymien (englanniksi 'wizard') eri vaiheiden esittämiseen ja niiden välillä siirtymiseen. Vaihenavigaation jokaiselle vaiheelle voidaan määritellä tila, jonka perusteella vaihe on joko avoinna siirryttäväksi tai vielä toistaiseksi estetty. Lisäksi vaihe voidaan määritellä suoritetuksi, jolloin sen yhteydessä näytetään check-merkki.",
      "text_3": "Vaihenavigaatio asemoidaan tavallisesti sivun vasempaan palstaan, lomakkeen ollessa sen oikealla puolella. Komponentti ottaa sivuttaissuunnassa kaiken se tilan, joka sille on tarjolla ja täten sen leveyttä kontrolloidaan ympäröivän elementin leveyttä säätämällä. Pienillä ruuduilla (mobiililaitteet) käytetään komponentista niille tarkoitettua varianttia ja asemoidaan komponentti sivun varsinaisen sisältöalueen yläpuolelle."
    },
    "component_example": {
      "title": "Vaiheet",
      "step_1": "1. Organisaatiotiedot",
      "step_2": "2. Yhteystiedot",
      "step_3": "3. Haettavat tiedot",
      "step_4": "4. Selvitys tietojen suojauksesta",
      "step_5": "5. Hyväksy ehdot"
    },
    "small_screen": {
      "heading": "Vaihenavigaatio pienillä näytöillä",
      "text_1": "Mobiililaitteilla vaihenavigaatio voidaan avata ja sulkea painikkeesta."
    }
  }
}
