{
    "title": "Murupolku (Breadcrumb)",
    "intro": "Murupolku on navigaatiokomponentti, joka esittää käyttäjälle kulloisenkin näkymän sijainnin verkkopalvelun rakenteessa. Murupolun avulla käyttäjä voi siirtyä verkkopalvelun sisältöhierarkiassa eri kohtiin.",
    "note.title": "Saavutettavuus",
    "note.items": [
      "Murupolun linkin nimi pitää olla sama kuin näkymän otsikko johon linkki johtaa",
      "Murupolku on piilotettu Suomifin käyttöliittymän mobiilikoossa, koska halutaan korostaa sivun asiasisältöä tuomalla mahdollisimman ylös sivun alkuun. Lisäksi murupolun käyttäminen mobiilinäkymässä on asettelun ja motorisen käytettävyyden kannalta haastavaa.",
      "Murupolut eivät lisää käytettävyyttä ja saavutettavuutta sellaisissa verkkopalveluissa, joiden suoraviivainen rakenne koostuu vain muutamista tasoista",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "sections": [
        {
          "title": "Mistä komponentti koostuu",
          "paragraphs": [
            {
              "image.key": "",
              "image.alt": "",
              "text": "Murupolku koostuu palvelun eri tasot koostavasta linkkirivistä. Käyttäjän nykyisen sijainnin linkkilistan viimeisenä esittävä tieto ei toimi linkkinä ja se myös erotttuu visuaalisesti klikattavista linkeistä."
            },
            {
              "image.key": "",
              "image.alt": "",
              "text": ""
            },
            {
              "image.key": "",
              "image.alt": "",
              "text": ""
            }
          ],
          "links": [
            {
              "text": "",
              "url": ""
            },
            {
              "text": "",
              "url": ""
            },
            {
              "text": "",
              "url": ""
            }
          ]
        },
        {
          "title": "Koko ja käyttö",
          "paragraphs": [
            {
              "image.key": "",
              "image.alt": "",
              "text": "Murupolkukomponenttia käytetään silloin kun halutaan auttaa käyttäjää ymmärtämään missä kyseinen sivu sijaitsee verkkopalvelun rakenteessa jam issä kohdin käyttäjä parhaillaan on. Murupolku auttaa myös käyttäjää siirtymään tasolta toiselle verkkopalvelun sisältöhierarkiassa. Murupolut ovat hyödyllisiä jos käyttäjä saapuu näkymään etusivun ohittavalla suoralla linkillä tai esimerkiksi hakukoneen kautta."
            },
            {
              "image.key": "",
              "image.alt": "",
              "text": ""
            },
            {
              "image.key": "",
              "image.alt": "",
              "text": ""
            }
          ],
          "links": [
            {
              "text": "",
              "url": ""
            },
            {
              "text": "",
              "url": ""
            },
            {
              "text": "",
              "url": ""
            }
          ]
        },
        {
          "title": "Murupolku käyttöliittymässä",
          "paragraphs": [
            {
              "image.key": "",
              "image.alt": "",
              "text": "Murupolku sijaitsee heti sivuston ylätunnisteen alapuolella."
            },
            {
              "image.key": "",
              "image.alt": "",
              "text": ""
            },
            {
              "image.key": "",
              "image.alt": "",
              "text": ""
            }
          ],
          "links": [
            {
              "text": "",
              "url": ""
            },
            {
              "text": "",
              "url": ""
            },
            {
              "text": "",
              "url": ""
            }
          ]
        }
      ]

}