{
  "title": "Painike",
  "intro": "Painike käynnistää toiminnon. Painiketta voidaan käyttää siirtymiseen toiseen näkymään (wizard) tai sillä voidaan hyväksyä toiminto (dialogi).",
  "note.title": "Ota huomioon käytössä",
  "note.items": [
    "Kun halutaan ohjata käyttäjä sivulta toiselle käytä painikkeen sijaan linkkiä",
    "Vähemmän tärkeät toiminnot kannattaa tyylitellä (muuttaa) linkeiksi",
    "Käytä ensisijaista painiketta toiminnolle joka vie seuraavalle sivulle ja toissijaista painiketta toiminnolle joka tapahtuu samalla sivulla",
    "Vältä käyttämästä liian monta painiketta sivua kohti",
    ""
  ],
  "sections": [
    {
      "title": "Mistä painike koostuu",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Teksti kertoo painikkeen toiminnon. Pyritään ytimekkyyteen mahdollisimman lyhyellä, mutta kuvaavalla nimeämisellä. Toimintopainike kertoo vain olennaisen toiminnan jonka se toteuttaa, ei mitään muuta, esimerkiksi \"Valitse\" tai \"Seuraava\". Jos toimintopainikkeen nimi on yli kolme sanaa pitkä, niin mieti miten sitä voidaan lyhentää. Painikkeen teksti on hyvä aloittaa verbillä ja alkaa aina isolla alkukirjaimella."
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        }
      ]
    },
    {
      "title": "",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        }
      ]
    },
    {
      "title": "",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        }
      ]
    }
  ],
  "fullWidth.title": "Koko ja käyttö",
  "fullWidth.description": "Mobiilikoossa käytetään leveää ‘keskitetty’ painiketta, joka skaalautuu näytön leveyden mukaan. Desktop-koossa käytetään kapeaa painiketta, joka skaalautuu painikkeen sisällön mukaan.",
  "primary.title": "Ensisijainen",
  "primary.description": "Ensisijaista painiketta käytetään kun toiminto on pakollinen tai olennainen prosessin tai muun toiminnan kannalta. Ensisijainen painike on yleisimmin käytetty painike. Painiketta käytetään erityisesti korostamaan pakollisia tai huomionarvoisia toimintoja. Ensisijaisen painikkeen käyttöä monta kertaa yhdessä näkymässä tulisi välttää.",
  "primary.label": "Ensisijainen",
  "primary.labelDisabled": "Estetty ensisijainen",
  "secondary.title": "Toissijainen",
  "secondary.description": "Toissijaista painiketta käytetään, jos painike ei ole olennainen esimerkiksi prosessin läpäisemisen kannalta. Jos toiminto ei ole pakollinen, kuten \"paluu edelliselle sivulle\" wizardissa, valitaan käyttöön toissijainen painike.",
  "secondary.label": "Toissijainen",
  "secondary.labelDisabled": "Estetty toissijainen",
  "tertiary.title": "Hienovarainen",
  "tertiary.description": "Painiketta käytetään vastaavasti kuin ensisijaista painiketta, eli kun kyseessä on pakollinen tai huomionarvoinen toiminto, jota ei kuitenkaan haluta korostaa liikaa. Painiketta voidaan käyttää esimerkiksi taulukossa, joissa sama painike toistuu riveittäin.",
  "tertiary.label": "Hienovarainen",
  "tertiary.labelDisabled": "Estetty hienovarainen",
  "secondaryNoborder.title": "Toissijainen ilman reunusta",
  "secondaryNoborder.description": "Jos toiminnon (yleensä toissijainen painike) huomioarvoa halutaan alentaa muihin nähden, voidaan käyttää painiketta ilman reunaviivaa, kuten esimerkiksi \"keskeytä\"-painike dialogissa. Silloin olennaiset toiminnot korostuvat, mutta säilytetään edelleen mahdollisuus keskeyttää prosessi.",
  "secondaryNoborder.label": "Tekstipainike",
  "secondaryNoborder.labelDisabled": "Estetty tekstipainike",
  "negative.title": "Negatiivinen",
  "negative.description": "Negatiivista painiketta käytetään erivärisillä taustoilla sekä kuvataustoissa.",
  "negative.label": "Negatiivinen",
  "negative.labelDisabled": "Estetty negatiivinen",
  "withIcon.title": "Painike ikonilla",
  "withIcon.description": "Painikkeessa käytetään ikonia selkeyttämään toimintoa tai erottamaan tärkeä toiminto muista painikkeista. Ikoni korostaa painikkeen roolia ja auttaa painikkeen tunnistamisessa. Kuvaava ikoni myös helpottaa ymmärtämään mitä painikkeesta tapahtuu.",
  "disabled.title": "Estetty painike",
  "disabled.description": "Estettyä painiketta käytetään silloin, kun toiminto ei ole jostain syystä klikattava. Painike voi olla estettynä esimerkiksi silloin, jos käyttäjä ei ole täyttänyt tarvittavia tietoja edetäkseen toiminnossa tai prosessissa eteenpäin. Estetty painike ei reagoi hover-toimintoon (hiireilyyn). Vaikka estetty painike ei täytä WCAG-kontrastivaatimusta, sitä on suositeltavaa käyttää, jos sen avulla voidaan parantaa käyttöliittymän ymmärrettävyyttä. Näin voidaan toimia, koska painikkeeseen ei kuitenkaan liity varsinaista toiminnallisuutta.",
  "button.labelIcon": "{{name}} ikoni vasen",
  "button.labelIconRight": "{{name}} ikoni oikea",
  "button.labelClicked": "{{name}}, painettu {{count}} kertaa"
}
