{
  "title": "Värit",
  "intro": "Pääväreihin kuuluvat sininen (brandBase) sekä (highlightBase), valkoinen (whiteBase) ja harmaa (depthBase). Tekstien päävärinä käytetään mustaa (blackBase). Korosteväreinä käytetään oranssia (accentBase) ja harmaan eri sävyjä. Yleisilme on vaalean neutraali, ja väriä käytetään harkiten korostamaan keskeisiä toimintoja ja sisältöjä.",
  "note.title": "Saavutettavuus ja käytettävyys",
  "note.items": [
    "Kun käytät komponenttien tarjoamaa valmista Suomi.fi-väriteemaa käyttöohjeistuksien mukaisesti, täyttyvät saavutettavuuskriteeristön (WCAG) kontrastivaatimukset ja väriyhdistelmät ovat saavutettavuudeltaan riittäviä.",
    "Jos haluat modifioida värit sopimaan erilaiseen visuaaliseen ilmeeseen, muista varmistaa, että valitsemasi väriyhdistelmien kontrastit täyttävät saavutettavuuskriteeristön (WCAG) asettamat vaatimukset.",
    "Huomioi, että saavutettavuuskriteeristön (WCAG) kontrastivaatimukset eivät koske komponentteja, joiden käyttö on estetty. On kuitenkin tärkeää varmistaa, että estetty sävy eroaa kontrastiltaan tarpeeksi aktiivisen tilan väristä. Suomi.fi-komponentteihin on toteutettu valmiiksi estetty-tila oikeaoppisesti.",
    "Tutustu näihin kohtiin tarkemmin saavutettavuuskriteeristön ohjeistuksessa: WCAG 2.1., onnistumiskriteeri 1.4.3 Kontrasti (minimi). ",
    ""
  ],
  "sections": [
    {
      "title": "",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        }
      ],
      "links": [
        {
          "text": "WCAG 2.1 kontrasti vaatimukset",
          "url": "https://www.w3.org/TR/WCAG21/"
        },
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        }
      ]
    },
    {
      "title": "",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        }
      ]
    },
    {
      "title": "",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": ""
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        }
      ]
    }
  ],
  "textColors.title": "Tekstit",
<<<<<<< HEAD
  "textColors.description": "Tekstien pääväri on musta (blackBase). Estetyissä (disabled) teksteissä käytetään vaalean harmaata (depthBase). Tekstin korostevärinä käytetään tummaa harmaata (depthDark1). Vihjeteksteissä käytetään tummanharmaata (blackLight1). Vihjetekstit tarkoittavat tekstejä, jotka ovat lomakekentissä ohjeistamassa käyttäjää ennen kuin käyttäjä aloittaa kirjoittamaan kenttään.",
=======
  "textColors.description": "Tekstien pääväri on musta (blackBase). Estetyissä (disabled) teksteissä käytetään vaalean harmaata (depthBase). Tekstin korostevärinä käytetään tummaa harmaata (depthBaseDark27). Vihjeteksteissä käytetään tummanharmaata (blackLight1).  Vihjetekstit tarkoittavat tekstejä, jotka ovat lomakekentissä ohjeistamassa käyttäjää ennen kuin käyttäjä aloittaa kirjoittamaan kenttään.",
>>>>>>> ccbb9e4b... Replace the old color token names with new ones and run prettier
  "brandColors.title": "Brändiväri",
  "brandColors.description": "Brändiväriä (brandBase) käytetään suomi.fi palveluiden logossa, alatunnisteessa sekä palveluiden yläreunan värillisessä palkissa.",
  "controlColors.title": "Linkit, painikkeet ja valinnat",
  "controlColors.description": "Sinistä (highlightBase) sekä siitä johdettuja vaalempia sävyä (highlightLight) käytetään interaktiivisissa elementeissä ja valittujen elementtien korostamisessa. Violettia (accentTertiaryDark1) käytetään linkkien vierailun jälkeisessä tilassa (visited state). Estetyissä tiloissa käytetään harmaata (depthBase). Sinisestä johdettua tummempaa sävyä (highlightDark1) käytetään esim. painikkeiden hovertilassa (hover state). Oranssia (accentBase) väriä käytetään kaikkien komponenttien fokustilassa (focus state). ",
  "iconColors.title": "Ikonit",
  "iconColors.description": "Kuvitusikoneissa käytetään harmaata (depthBase) sekä oranssia (accentBase) korostevärinä. Toiminnallisissa ikoneissa käytetään toiminnallisten elementtien sinistä (highlightBase) väriä sekä tummaa harmaata (depthDark1).",
  "backgroundColors.title": "Taustat ja reunukset",
<<<<<<< HEAD
  "backgroundColors.description": "Sivun taustaväri on vaalean harmaa (depthLight3) ja sisältöalueen tausta on valkea (whiteBase). Reunuksien väri on harmaa (depthLight1). Lisäksi käytössä on sinisestä (highlightBase) väristä johdettuja sävyjä (highlightLight4, highlightLight3 ja highlightLight2) sekä kirkkaan vaaleansininen (depthSecondary). ",
=======
  "backgroundColors.description": "Sivun taustaväri on vaalean harmaa (depthLight3) ja sisältöalueen tausta on valkea (whiteBase). Reunuksien väri on harmaa (depthLight1). Lisäksi käytössä on sinisestä (highlightBase) väristä johdettuja sävyjä (highlightLight3, highlightLight3 ja highlightLight2) sekä kirkkaan vaaleansininen (depthSecondary). ",
>>>>>>> ccbb9e4b... Replace the old color token names with new ones and run prettier
  "trafficColors.title": "Liikennevalovärit",
  "trafficColors.description": "Liikennevalovärit kuvaavat komponenttien, elementtien tai toimintojen tilatietoa. Vihreä (successBase) kuvaa onnistumista tai positiivista toimintoa. Keltainen (warningBase) kuvaa esim. tehtävää tai muuta asiaa, johon käyttäjän tulee reagoida. Punainen (alertBase) kuvaa virhetilaa tai häiriötä. Pelkkä väri ei riitä tiedon tai toiminnallisuuksien esittämiseen vaan tieto pitää esittää myös sanallisesti.",
  "accentColors.title": "Korostevärit",
  "accentColors.description": "Korostevärejä käytetään tilanteissa, joissa väriä tarvitaan luomaan eroavaisuutta.",
  "blackBase.label": "Text Dark",
  "blackLight1.label": "Text Grey",
  "depthBase.label": "Arctic Hill",
  "depthLight3.label": "Arctic Hill Light",
  "depthLight1.label": "Arctic Hill Light",
  "depthLight2.label": "Arctic Hill Light",
  "depthDark1.label": "Artic Hill Dark",
  "depthSecondary.label": "Blueberry Milk",
  "depthSecondaryDark1.label": "Blueberry Milk Dark",
  "brandBase.label": "Suomi.fi",
  "highlightBase.label": "Lake",
  "highlightLight1.label": "Lake Light",
  "highlightLight2.label": "Lake Light",
  "highlightLight3.label": "Lake Light",
  "highlightLight4.label": "Lake Light",
  "highlightDark1.label": "Lake Dark",
  "accentBase.label": "Cloudberry",
  "accentSecondary.label": "Sky",
  "accentSecondaryLight1.label": "Sky Light",
  "accentTertiary.label": "Heather",
  "accentTertiaryDark1.label": "Heather Dark",
  "successBase.label": "Traffic Green",
  "successSecondary.label": "Traffic Green Light",
  "warningBase.label": "Traffic Yellow",
  "warningLight47.label": "Traffic Red Light",
  "alertBase.label": "Traffic Red",
  "alertLight1.label": "Traffic Red Light",
  "whiteBase.label": "Snow"
}
