{
  "title": "Kehittäjille",
  "intro": "Suomi.fi Design System -kirjasto perustuu Suomi.fi-palveluiden käyttökokemukseen ja käyttöliittymäkomponentteihin. Käyttöliittymien kaikki elementit on suunniteltu ja kehitetty saavutettavuusvaatimusten mukaan (WCAG 2.1 -kriteeristön tasot A ja AA). Komponentit julkaistaan ReactJS (Javascript) ‑muodossa GitHubissa.",
  "sections": [
    {
      "title": "Versiointi ja päivitys",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Käyttöliittymäkomponenttikirjastoa ja suunnittelun pohjana olevaa tyyliopasta kehitetään jatkuvasti osana Suomi.fi-palvelujen kehitystä. Parannuksia ja lisäyksiä tehdään saavutettavuuden, käytettävyyden ja palveluiden tarpeiden mukaisesti. Komponenttikirjasto noudattaa semanttisen versioinnin (Semantic Versioning) säännöstöä. Julkaisutiedot (Release Notes) käyttöliittymäkomponenttikirjaston muutoksista ja julkaistavista versioista löytyvät Git Repositorystä.",
          "listItems": [
            { "text": "" },
            { "text": "" },
            { "text": "" },
            { "text": "" },
            { "text": "" }
          ]
        }
      ],
      "links": [
        {
          "text": "Release Notes GitHub",
          "url": "https://github.com/vrk-kpa/suomifi-ui-components/releases"
        },
        { "text": "", "url": "" },
        { "text": "", "url": "" }
      ]
    },
    {
      "title": "Yhteiskehittäminen",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Suomi.fi Design Systemin tarkempi yhteiskehittämisen malli ja sen dokumentointi on parhaillaan työn alla, mutta voit jo nyt osallistua kehitystyöhön GitHubin kautta. Design Systemin käyttäjänä voit myös kontribuoida Open Source -hengen mukaisesti GitHubin työkaluja käyttämällä.",
          "listItems": [
            { "text": "" },
            { "text": "" },
            { "text": "" },
            { "text": "" },
            { "text": "" }
          ]
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": "Käyttöliittymäkomponenttien kirjasto on MIT-lisenssin alainen, eli kuka tahansa saa käyttää, hyödyntää ja jakaa sisältöä mihin tahansa käyttötarkoitukseen. Käyttäjien on mahdollista toivoa uusia ominaisuuksia, raportoida bugeista sekä tuottaa uutta sisältöä. Muutokset ja lisäykset kannattaa tehdä oman projektin sijaan yhteisesti käytettyyn kirjastoon, jolloin tehdystä työsä hyötyvät kaikki käyttäjät.",
          "listItems": [
            { "text": "" },
            { "text": "" },
            { "text": "" },
            { "text": "" },
            { "text": "" }
          ]
        }
      ],
      "links": [
        {
          "text": "Suomi.fi-komponentit GitHubissa",
          "url": "https://github.com/vrk-kpa/suomifi-ui-components"
        },
        { "text": "", "url": "" },
        { "text": "", "url": "" }
      ]
    }
  ]
}
