{
  "title": "Etusivu",
  "intro.title": "Suomi.fi Design System – digipalvelujen yhteiset rakennuspalikat",
  "intro.description": "Suomi.fi Design System tarjoaa kokoelman uudelleenkäytettäviä ja dokumentoituja käyttöliittymäkomponentteja. Kaikki komponentit on toteutettu ja testattu saavutettavuusvaatimusten mukaisesti. ",
  "sections": [
    {
      "mainTitle": "Mitä Suomi.fi Design System sisältää?",
      "blocks": [
        {
          "icon": "",
          "title": "Design System -sivusto",
          "paragraphs": [
            {
              "text": "Tältä sivustolta löydät tiedot kaikista Suomi.fi Design Systemissä julkaistuista komponenteista, ja kunkin komponentin yhteydestä myös esikatselumallit, koodiesimerkit ja käyttöohjeistukset. Ohjeistuksessa nostetaan esille erityisesti saavutettavuuteen ja käytettävyyteen liittyviä asioita. Komponentit ovat vapaasti hyödynnettävissä joko sellaisenaan, tai niitä voi muokata vastaamaan oman palvelun visuaalista ulkoasua. Suomi.fi Design System -kirjastoa kehittää ja ylläpitää Digi- ja väestötietovirasto."
            },
            { "text": "" },
            { "text": "" }
          ],
          "links": [
            {
              "text": "Lue taustatietoja Suomi.fi Design Systemistä",
              "url": "/info"
            },
            { "text": "", "url": "" },
            { "text": "", "url": "" }
          ]
        },
        {
          "icon": "",
          "title": "Käyttöliittymäkomponenttien kirjasto",
          "paragraphs": [
            {
              "text": "Suomi.fi Design System -kirjasto perustuu Suomi.fi-palveluiden käyttökokemukseen ja käyttöliittymäkomponentteihin. Käyttöliittymäkomponenttikirjastoa ja suunnittelun pohjana olevaa tyyliopasta kehitetään jatkuvasti osana Suomi.fi-palvelujen kehitystä. Parannuksia ja lisäyksiä tehdään saavutettavuuden, käytettävyyden ja palveluiden tarpeiden mukaisesti."
            },
            {
              "text": "Käyttöliittymien kaikki elementit on suunniteltu ja kehitetty saavutettavuusvaatimusten mukaan (WCAG 2.1 -kriteeristön tasot A ja AA). Komponentit julkaistaan ReactJS (Javascript) ‑muodossa ja julkaistava kirjasto noudattaa semanttista versiointia."
            }
          ],
          "links": [
            { "text": "Tutustu komponentteihin", "url": "/components" },
            { "text": "", "url": "" },
            { "text": "", "url": "" }
          ]
        },
        {
          "icon": "",
          "title": "",
          "paragraphs": [
            { "text": "" },
            { "text": "Onko sinulla ehdotuksia tai muuta palautetta?" },
            { "text": "" }
          ],
          "links": [
            { "text": "Yhteystiedot", "url": "/info" },
            { "text": "", "url": "" },
            { "text": "", "url": "" }
          ]
        }
      ]
    }
  ]
}
