{
  "title": "Sivutus (Pagination)",
  "intro": "Sivutus on komponentti jonka avulla käyttäjä voi navigoida useille sivuille jaettua sisältöä. Esimerkiksi hakutuloksia.",
  "note.title": "Saavutettavuus ja käytettävyys",
  "note.items": [
    "On hyvä harkita kannattaako sivutusta käyttää laisinkaan jos tiedetään, että sivuja on kolme tai vähemmän.",
    "Ruudunlukijaa varten on erikseen oma teksti sivunumeron tietokenttää varten. Esimerkiksi näkyvän tekstin \"Sivu 1 / 20\" sijaan ruudunlukijalle on parempi antaa teksti \"Sivu 1 kautta 20\"",
    "Ota huomioon yksittäisten sivujen pituus. Kätevä tapa mitata sivun kokoa on katsoa vierityspalkin korkeutta. Se ei saisi olla liian lyhyt eikä liian pitkä.",
    "Huomioi, että tieto sivun vaihdosta välitetään ruudunlukijalle. Komponentissa on visuaalisesti piilotettu kenttä tätä tarkoitusta varten (aria-live aria-atomic).",
    "Ota huomioon mihin fokus siirtyy sivun vaihdon jälkeen.",
    ""
  ],
  "sections": [
    {
      "title": "Mistä komponentti koostuu",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Sivutus koostuu kahdesta nuolinapista, tietokentästä sekä sivunumeron syötekentästä. Nuolinapeilla käyttäjä voi siirtyä yhden sivun kerrallaan joko eteen tai taaksepäin.  Tietokenttä on nuolinappien välissä ja sen tarkoitus on kertoa käyttäjälle nykyisen sekä viimeisen sivun numerot. Syötekentän avulla käyttäjä voi siirtyä suoraan haluamalleen sivulle."
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        }
      ]
    },
    {
      "title": "Komponentin koko, käyttö ja variaatiot",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Työpöytä- ja mobiilikäyttöön on määritelty erikseen omat koot sivutuskomponentista. Mobiilinäytöille suunnitellussa versiossa syötekenttä on nuolinappien alapuolella. Komponentista on myös variaatio ilman syötekenttää."
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": "Komponentti sisältää myös visuaalisesti piilotetun kentän ruudunlukijakäyttäjiä varten. Sen tehtävä on välittää tieto sivun vaihtumisesta. "
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        }
      ]
    }
  ],
  "example.basic.heading": "Normaali käyttötapaus",
  "example.basic.description": "Esimerkissä sivun vaihtuessa ruudunlukijalle annetaan tarkempaa tietoa sivun sisällöstä",
  "example.success.heading": "Sivutus ilman syötekenttää",
  "example.success.description": "",
  "example.error.heading": "Sivutuksen mobiiliversio",
  "example.error.description": ""
}
