{
  "title": "Sivutus (Pagination)",
  "intro": "Sivutus on komponentti, jonka avulla käyttäjä voi navigoida useille sivuille jaettua sisältöä. Sivustusta käytetään esimerkiksi hakutulosten näyttämiseen.",
  "note.title": "Saavutettavuus ja käytettävyys",
  "note.items": [
    "Tieto sivun vaihdosta välitetään ruudunlukijalle. Komponentissa on visuaalisesti piilotettu kenttä tätä tarkoitusta varten.",
    "Mikäli sivuja on paljon, käyttäjälle voidaan tarjota mahdollisuus sivunumeron syöttämiseen erilliseen sivunumerokenttään.",
    "Ruudunlukijalle sivunumeron tietokentän teksti kannattaa antaa ilman erikoismerkkejä, esimerkiksi \"Sivu 1 kautta 20\", sillä erikoismerkkien lukutapa saattaa vaihdella.",
    ""
  ],
  "sections": [
    {
      "title": "Mistä komponentti koostuu",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Sivutus koostuu kahdesta nuolipainikkeesta, tietokentästä sekä valinnaisesta sivunumeron syötekentästä. Nuolinpainikkeilla käyttäjä voi siirtyä yhden sivun kerrallaan eteen- tai taaksepäin. Tietokenttä on nuolipainikkeiden välissä ja sen tarkoitus on kertoa käyttäjälle nykyisen sekä viimeisen sivun numerot. Syötekentän avulla käyttäjä voi siirtyä suoraan haluamalleen sivulle."
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        }
      ]
    },
    {
      "title": "Komponentin koko, käyttö ja variaatiot",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Työpöytä- ja mobiilikäyttöön on määritelty erikseen omat koot sivutuskomponentista. Mobiilinäytöille suunnitellussa versiossa syötekenttä on nuolipainikkeiden alapuolella. Komponentin oletusvariaatio ei sisällä syötekenttää. Syötekenttää voidaan käyttää, jos sivuja on paljon."
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": "Komponentti tulee sijoittaa sivutettavan sisällön alapuolelle."
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": "Sivun vaihtuessa voi ruudunlukijalle antaa sisällöstä lisätietoa, esimerkiksi \"Sivu 2 kautta 5. Näytetään tulokset 10 viiva 20.\"."
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        }
      ]
    }
  ],
  "example.basic.heading": "Normaali käyttötapaus",
  "example.basic.description": "Esimerkissä sivun vaihtuessa ruudunlukijalle annetaan tarkempaa tietoa sivun sisällöstä",
  "example.success.heading": "Sivutus ilman syötekenttää",
  "example.success.description": "",
  "example.error.heading": "Sivutuksen mobiiliversio",
  "example.error.description": ""
}
