{
  "title": "Sivutus (Pagination)",
  "intro": "Sivutus on komponentti, jonka avulla käyttäjä voi navigoida useille sivuille jaettua sisältöä. Sivustusta käytetään esimerkiksi hakutulosten näyttämiseen.",
  "note.title": "Saavutettavuus ja käytettävyys",
  "note.items": [
    "Ruudunlukijaa varten on erikseen oma teksti sivunumeron tietokenttää varten. Esimerkiksi näkyvän tekstin \"Sivu 1 / 20\" sijaan ruudunlukijalle on parempi antaa teksti \"Sivu 1 kautta 20\"",
    "Tieto sivun vaihdosta välitetään ruudunlukijalle. Komponentissa on visuaalisesti piilotettu kenttä tätä tarkoitusta varten.",
    "Mikäli sivuja on paljon, käyttäjälle voidaan tarjota mahdollisuus sivunumeron syöttämiseen erilliseen sivunumerokenttään.",
    ""
  ],
  "sections": [
    {
      "title": "Mistä komponentti koostuu",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Sivutus koostuu kahdesta nuolipainikkeesa, tietokentästä sekä valinnaisesta sivunumeron syötekentästä. Nuolinpainikkeilla käyttäjä voi siirtyä yhden sivun kerrallaan joko eteen tai taaksepäin. Tietokenttä on nuolipainikkeiden välissä ja sen tarkoitus on kertoa käyttäjälle nykyisen sekä viimeisen sivun numerot. Syötekentän avulla käyttäjä voi siirtyä suoraan haluamalleen sivulle."
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        }
      ]
    },
    {
      "title": "Komponentin koko, käyttö ja variaatiot",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Työpöytä- ja mobiilikäyttöön on määritelty erikseen omat koot sivutuskomponentista. Mobiilinäytöille suunnitellussa versiossa syötekenttä on nuolinappien alapuolella. Komponentista on myös variaatio ilman syötekenttää."
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": "Komponentti sisältää myös visuaalisesti piilotetun kentän ruudunlukijakäyttäjiä varten. Sen tehtävä on välittää tieto sivun vaihtumisesta. "
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        }
      ]
    }
  ],
  "example.basic.heading": "Normaali käyttötapaus",
  "example.basic.description": "Esimerkissä sivun vaihtuessa ruudunlukijalle annetaan tarkempaa tietoa sivun sisällöstä",
  "example.success.heading": "Sivutus ilman syötekenttää",
  "example.success.description": "",
  "example.error.heading": "Sivutuksen mobiiliversio",
  "example.error.description": ""
}
