{
  "title": "Sivunavigaatio (Side navigation)",
  "intro": "Sivunavigaatiota käytetään sisältösivujen välillä navigointiin erityisesti silloin kun sivut on ryhmitelty useaan eri alakategoriaan.",
  "note.title": "Saavutettavuus ja käytettävyys",
  "note.items": [
    "Komponentin otsikon ja navigaatioelementtien tekstisisältöjen tulee olla kuvaavia, ja ne on hyvä pyrkiä pitämään mahdollisimman lyhyinä.",
    "Ruudunlukijasaavutettavuuden varmistamiseksi tulee huolehtia, että yksittäisille navigaatioelementeille (linkit) asetetaan asianmukaiset aria-attribuutit: aria-current=page tällä hetkellä aktiiviselle sivulle, aria-label mikäli halutaan välittää linkin tekstisisällön ulkopuolista informaatiota ja aria-disabled mikäli linkki on estetty. Estettyjen linkkien tulee kuitenkin olla näppäimistökäyttäjien saavutettavissa.",
    "Komponentille tulee antaa ylätason aria-label, joka kertoo ruudunlukijalle navigaation kontekstin ja tarkoituksen.",
    "Sivunavigaatiolle on lisäksi hyvä antaa HTML-id, jotta siihen voidaan liikkua suoraan esimerkiksi SkipLink-navigaatioelementeistä.",
    "Linkkejä klikattaessa sivunavigaatiota käyttävän sovelluksen on huolehdittava ruudunlukijan saavan täsmällisen tiedon siitä, että siirryttiin uuteen näkymään."
  ],
  "sections": [
    {
      "title": "Mistä komponentti koostuu",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Sivunavigaatio on navigaatioelementti, jonka sisällä on lista. Komponentin tekninen toteutus mahdollistaa sen, että lista voi sisältää tavanomaisten linkkien lisäksi esimerkiksi painikkeita tai muita semanttisia elementtejä. Kaikki listan elementit ovat kuitenkin semantiikasta huolimatta visuaaliselta tyyliltään samanlaisia. Varsinaisen linkkilistan lisäksi komponenttiin kuuluu sen otsikko sekä siihen liittyvä ikoni."
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": "Sivunavigaatiossa linkit ovat hierarkisesti puurakenteessa. Komponentissa on mahdollista näyttää linkkejä kolmessa tasossa. Navigaatioelementin ollessa aktiivisena sen alasivut ovat näkyvissä."
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": "Kapeille ruuduille suunnitellussa variantissaan komponentti sisältää painikkeen, josta varsinainen navigaatioelementti voidaan näyttää ja piilottaa. "
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        }
      ]
    },
    {
      "title": "Koko ja käyttö",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Navigaatioelementtien sisällä on yllä olevan koodiesimerkin mukaisesti suunniteltu käytettävän RouterLink-komponenttia, joka voidaan semanttisesti renderöidä minä tahansa komponenttina kuten painikkeena tai jonkin kirjaston omana linkkikomponenttina. Tutustu komponentin tekniseen dokumentaatioon saadaksesi lisää esimerkkejä RouterLinkin käytöstä."
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": "Palvelunavigaatio asemoidaan tavallisesti sivun vasempaan palstaan, sisältöalueen ollessa sen oikealla puolella. Se ottaa sivuttaissuunnassa kaiken se tilan, joka sille on tarjolla ja täten sen leveyttä kontrolloidaan ympäröivän elementin leveyttä säätämällä. Pienillä ruuduilla (mobiililaitteet) käytetään komponentista niille tarkoitettua varianttia ja asemoidaan komponentti sivun varsinaisen sisältöalueen yläpuolelle. "
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        }
      ]
    }
  ],
  "example.title": "Parisuhde ja perhe",
  "example.arialabel": "Sivustonavigaatio",
  "example.navitem1": "Parisuhde",
  "example.navitem1-2-1": "Tietoa eri parisuhdemuodoista",
  "example.navitem1-2-2": "Avioliiton solmiminen",
  "example.navitem1-2-1-1": "Tietoa avioliitosta",
  "example.navitem1-2-1-2": "Tietoa avoliitosta",
  "example.navitem1-2-1-3": "Tietoa rekisteröidystä parisuhteesta",
  "example.navitem2": "Lapsen saaminen ja hoito",
  "example.navitem3": "Tervetuloa täysi-ikäiseksi!",
  "example.navitem4": "Avo- tai avioero",
  "example.navitem5": "Läheisen kuolema",
  "example.smallscreen.title": "Pienen ruutukoon variantti",
  "example.smallscreen.paragraph": "Mobiililaitteilla sivunavigaatio voidaan avata ja sulkea painiketta painamalla"
}
