{
  "title": "Ponnahdusilmoitus (Toast)",
  "intro": "Ponnahdusilmoitus on komponentti, jonka avulla käyttäjälle voidaan välittää käyttäjän toimintaan liittyvää palautetta. Käytetään tilanteissa, jotka eivät vaadi käyttäjältä varsinaista reagointia. Ponnahdusilmoitus kertoo, että käyttäjän suorittama toimenpide onnistui.",
  "note.title": "Saavutettavuus ja käytettävyys",
  "note.items": [
    "Mikäli ponnahdusilmoituksia on tarkoitus lisätä sivulle dynaamisesti, niitä varten kannattaa luoda ruudunlukijakäyttäjiä varten live region(ulkoinen linkki sivun alaraunasssa), jonka sisään ilmoitukset lisätään. Tällöin myös ruudunlukijakäyttäjät saavat tiedon sivulle lisätystä ponnahdusilmoituksesta.",
    "Ponnahdusilmoituksen otsikkotaso on määriteltävissä käyttötapauksen mukaan.",
    "Sivulla voi olla yhtä aikaa useita ponnahdusilmoituksi näkyvissä."
  ],
  "sections": [
    {
      "title": "Mistä komponentti koostuu",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Komponentti koostuu kuvaavasta ikonista, otsikosta ja pääsisällöstä."
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        }
      ]
    },
    {
      "title": "Koko ja käyttö",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Ponnahdusilmoitukset tulee pitää näkyvissä joko 10 sekunttia tai niin kauan kuin käyttäjä pitää hiirtä ilmoituksen päällä. Ponnahdusilmoitukset tulee poistaa näkyvistä liukumalla ylös."
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": "Työpöytänäkymässä, kun sivu on vieritetty ylös, ponnahdusilmoitus tulee olla sivun ylälaitaan kiinnittyneenä. Kun käyttäjä scrollaa sivulla alaspäin niin, että sivu ylälaita peittyy, tulee ponnahdusilmoitus liukua näkyviin oikeaan ylälaitaan. Ponnahdusilmoitus siis kelluu mukana, kun sivua scrollataan alas."
        }
      ],
      "links": [
        {
          "text": "Live region",
          "url": "https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA/ARIA_Live_Regions"
        }
      ]
    }
  ],
  "example.content": "Tallentaminen onnistui"
}
