{
  "title": "Valintakytkin (Toggle Switch)",
  "intro": "Valintakytkintä käytetään esimerkiksi kahden toisensa pois sulkevan tilan tai toiminnan vaihtamisessa. Sitä ei pidä käyttää korvaamaan valintaruutu-komponenttia (checkbox). Käytä valintakytkintä harkiten. ",
  "note.title": "Saavutettavuus ja käytettävyys",
  "note.items": [
    "Kognitiivisen saavutettavuuden kannalta on suositeltavaa esittää selkeä ohjeistusteksti komponentin yhteydessä, koska valintakytkin muuttaa, piilottaa tai muokkaa sisältöä valinnan mukaisesti.",
    "Käytä valintakytkintä harkiten. Suomi.fi:ssä valintakytkin-komponenttia käytetään vain tilan muutokseen. Esimerksiksi Suomi.fi:n hakutoiminnossa valintakytkimellä saa hakutuloksissa näkyviin vain viittomakielisten sisältöjen hakutulokset.",
    "",
    "",
    ""
  ],
  "sections": [
    {
      "title": "Mistä komponentti koostuu",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Valintakytkimessä näytettävä label-teksti kertoo, mitä ollaan kytkemässä päälle tai pois. Komponentissa on kaksi tilaa, pois päältä ja päällä. Pois päältä -tila on harmaa ja päällä-tila on pääosin vihreä. Valintakytkin voi olla myös disabloitu molemmissa tiloissa. Komponentin yhteyteen on hyvä liittää ohjeteksti, jotta käyttäjä ymmärtää, mikä toimenpide tapahtuu, kun valintakytkimen asentoa muutetaan."
        }
      ],
      "links": [
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        }
      ]
    },
    {
      "title": "Koko ja käyttö",
      "paragraphs": [
        {
          "image.key": "",
          "image.alt": "",
          "text": "Valintakytkin piilottaa, vaihtaa, muuttaa sisällön tai näkymän valinnan mukaisesti. Toiminto tapahtuu välittömästi eikä vaadi käyttäjältä muuta erillistä vahvistusta. Valintakytkimessä on aina yksi oletustila valmiiksi valittuna. Valintakytkintä tulisi käyttää ainoastaan sellaisissa tilanteissa, joissa käyttäjän täytyy valita kahdesta vastakkaisesta tilasta, esimerkiksi asettaa jokin toiminto päälle tai pois päältä."
        },
        {
          "image.key": "",
          "image.alt": "",
          "text": "Valintakytkimen vaiheiden vastakohtaiset värit tulisi tukea komponentin käytettävyyttä ja auttaa käyttäjää hahmottamaan, missä tilassa kytkin on (päällä/pois päältä). Jos muokkaat väriä, muista huomioida saavutettavuusvaatimukset (WCGA 2.1) ja eri tilojen riittävä eroavuus toisistaan."
        }
      ],
      "links": [
        {
          "text": "WCAG 2.1 – 1.4.1 Värien käyttö",
          "url": "https://www.w3.org/Translations/WCAG21-fi/#use-of-color"
        },
        {
          "text": "WCAG 2.1 – 1.4.3 Kontrasti (minimi)",
          "url": "https://www.w3.org/Translations/WCAG21-fi/#contrast-minimum"
        },
        {
          "text": "",
          "url": ""
        },
        {
          "text": "",
          "url": ""
        }
      ]
    }
  ],
  "default.title": "",
  "default.description": "",
  "toggle.label": "Esimerkkitoiminto",
  "toggle.state.on": "{{name}} päällä.",
  "toggle.state.off": "{{name}} pois päältä."
}
